zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from MIMXRT685SFFOB/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MIMXRT685SFFOB_
#define _ZEPHYR_DTS_BINDING_MIMXRT685SFFOB_

#define IOPCTL_MUX(index, offset, mux)		\
	((((index) & 0xF) << 16) |		\
	(((offset) & 0xFFF) << 20) |		\
	(((mux) & 0xF) << 0))

#define CTIMER0_MATCH0_PIO0_0 IOPCTL_MUX(0, 0, 4) /* PIO0_0 */
#define DMA0_TRIG0_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG10_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG11_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG12_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG13_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG14_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG15_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG16_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG17_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG18_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG19_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG1_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG20_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG21_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG22_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG23_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG24_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG25_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG26_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG27_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG28_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG29_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG2_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG30_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG31_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG32_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG3_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG4_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG5_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG6_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG7_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG8_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA0_TRIG9_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG0_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG10_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG11_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG12_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG13_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG14_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG15_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG16_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG17_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG18_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG19_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG1_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG20_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG21_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG22_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG23_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG24_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG25_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG26_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG27_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG28_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG29_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG2_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG30_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG31_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG32_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG3_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG4_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG5_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG6_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG7_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG8_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define DMA1_TRIG9_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define FC0_SCK_PIO0_0 IOPCTL_MUX(0, 0, 1) /* PIO0_0 */
#define GPIO_INT_BMAT_PIO0_0 IOPCTL_MUX(0, 0, 6) /* PIO0_0 */
#define GPIO_PIO00_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define I2S_BRIDGE_CLK_IN_PIO0_0 IOPCTL_MUX(0, 0, 5) /* PIO0_0 */
#define PINT_PINT0_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT_PINT1_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT_PINT2_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT_PINT3_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT_PINT4_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT_PINT5_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT_PINT6_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define PINT_PINT7_PIO0_0 IOPCTL_MUX(0, 0, 0) /* PIO0_0 */
#define SECGPIO_SECPIO00_PIO0_0 IOPCTL_MUX(0, 0, 8) /* PIO0_0 */
#define PMIC_I2C_SCL IOPCTL_MUX(0, 256, 0) /* PIO0_0 */
#define PMIC_I2C_SDA IOPCTL_MUX(0, 257, 0) /* PIO0_0 */
#define CTIMER0_MATCH1_PIO0_1 IOPCTL_MUX(0, 1, 4) /* PIO0_1 */
#define DMA0_TRIG0_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG10_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG11_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG12_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG13_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG14_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG15_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG16_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG17_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG18_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG19_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG1_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG20_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG21_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG22_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG23_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG24_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG25_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG26_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG27_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG28_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG29_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG2_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG30_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG31_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG32_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG3_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG4_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG5_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG6_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG7_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG8_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA0_TRIG9_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG0_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG10_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG11_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG12_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG13_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG14_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG15_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG16_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG17_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG18_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG19_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG1_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG20_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG21_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG22_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG23_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG24_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG25_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG26_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG27_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG28_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG29_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG2_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG30_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG31_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG32_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG3_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG4_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG5_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG6_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG7_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG8_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define DMA1_TRIG9_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define FC0_TXD_SCL_MISO_WS_PIO0_1 IOPCTL_MUX(0, 1, 1) /* PIO0_1 */
#define GPIO_PIO01_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define I2S_BRIDGE_WS_IN_PIO0_1 IOPCTL_MUX(0, 1, 5) /* PIO0_1 */
#define PINT_PINT0_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT_PINT1_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT_PINT2_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT_PINT3_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT_PINT4_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT_PINT5_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT_PINT6_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define PINT_PINT7_PIO0_1 IOPCTL_MUX(0, 1, 0) /* PIO0_1 */
#define SECGPIO_SECPIO01_PIO0_1 IOPCTL_MUX(0, 1, 8) /* PIO0_1 */
#define CTIMER0_MATCH2_PIO0_2 IOPCTL_MUX(0, 2, 4) /* PIO0_2 */
#define DMA0_TRIG0_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG10_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG11_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG12_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG13_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG14_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG15_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG16_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG17_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG18_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG19_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG1_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG20_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG21_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG22_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG23_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG24_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG25_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG26_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG27_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG28_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG29_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG2_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG30_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG31_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG32_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG3_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG4_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG5_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG6_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG7_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG8_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA0_TRIG9_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG0_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG10_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG11_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG12_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG13_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG14_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG15_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG16_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG17_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG18_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG19_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG1_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG20_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG21_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG22_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG23_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG24_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG25_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG26_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG27_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG28_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG29_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG2_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG30_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG31_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG32_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG3_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG4_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG5_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG6_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG7_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG8_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define DMA1_TRIG9_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define FC0_RXD_SDA_MOSI_DATA_PIO0_2 IOPCTL_MUX(0, 2, 1) /* PIO0_2 */
#define GPIO_PIO02_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define I2S_BRIDGE_DATA_IN_PIO0_2 IOPCTL_MUX(0, 2, 5) /* PIO0_2 */
#define PINT_PINT0_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT_PINT1_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT_PINT2_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT_PINT3_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT_PINT4_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT_PINT5_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT_PINT6_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define PINT_PINT7_PIO0_2 IOPCTL_MUX(0, 2, 0) /* PIO0_2 */
#define SECGPIO_SECPIO02_PIO0_2 IOPCTL_MUX(0, 2, 8) /* PIO0_2 */
#define CTIMER0_MATCH3_PIO0_3 IOPCTL_MUX(0, 3, 4) /* PIO0_3 */
#define DMA0_TRIG0_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG10_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG11_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG12_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG13_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG14_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG15_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG16_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG17_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG18_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG19_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG1_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG20_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG21_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG22_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG23_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG24_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG25_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG26_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG27_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG28_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG29_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG2_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG30_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG31_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG32_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG3_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG4_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG5_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG6_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG7_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG8_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA0_TRIG9_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG0_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG10_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG11_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG12_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG13_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG14_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG15_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG16_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG17_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG18_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG19_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG1_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG20_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG21_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG22_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG23_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG24_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG25_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG26_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG27_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG28_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG29_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG2_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG30_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG31_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG32_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG3_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG4_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG5_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG6_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG7_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG8_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define DMA1_TRIG9_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define FC0_CTS_SDA_SSEL0_PIO0_3 IOPCTL_MUX(0, 3, 1) /* PIO0_3 */
#define FC1_SSEL2_PIO0_3 IOPCTL_MUX(0, 3, 5) /* PIO0_3 */
#define GPIO_PIO03_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT0_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT1_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT2_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT3_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT4_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT5_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT6_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define PINT_PINT7_PIO0_3 IOPCTL_MUX(0, 3, 0) /* PIO0_3 */
#define SECGPIO_SECPIO03_PIO0_3 IOPCTL_MUX(0, 3, 8) /* PIO0_3 */
#define CMP0_OUT_PIO0_4 IOPCTL_MUX(0, 4, 7) /* PIO0_4 */
#define CTIMER0_CAPTURE0_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER0_CAPTURE1_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER0_CAPTURE2_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER0_CAPTURE3_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER1_CAPTURE0_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER1_CAPTURE1_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER1_CAPTURE2_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER1_CAPTURE3_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER2_CAPTURE0_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER2_CAPTURE1_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER2_CAPTURE2_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER2_CAPTURE3_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER3_CAPTURE0_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER3_CAPTURE1_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER3_CAPTURE2_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER3_CAPTURE3_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER4_CAPTURE0_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER4_CAPTURE1_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER4_CAPTURE2_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define CTIMER4_CAPTURE3_PIO0_4 IOPCTL_MUX(0, 4, 4) /* PIO0_4 */
#define DMA0_TRIG0_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG10_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG11_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG12_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG13_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG14_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG15_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG16_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG17_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG18_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG19_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG1_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG20_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG21_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG22_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG23_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG24_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG25_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG26_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG27_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG28_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG29_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG2_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG30_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG31_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG32_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG3_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG4_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG5_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG6_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG7_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG8_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA0_TRIG9_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG0_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG10_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG11_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG12_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG13_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG14_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG15_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG16_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG17_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG18_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG19_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG1_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG20_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG21_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG22_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG23_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG24_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG25_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG26_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG27_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
