zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA1_TRIG28_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG29_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG2_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG30_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG31_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG32_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG3_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG4_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG5_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG6_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG7_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG8_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define DMA1_TRIG9_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define FC0_RTS_SCL_SSEL1_PIO0_4 IOPCTL_MUX(0, 4, 1) /* PIO0_4 */
#define FC1_SSEL3_PIO0_4 IOPCTL_MUX(0, 4, 5) /* PIO0_4 */
#define GPIO_PIO04_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT0_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT1_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT2_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT3_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT4_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT5_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT6_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define PINT_PINT7_PIO0_4 IOPCTL_MUX(0, 4, 0) /* PIO0_4 */
#define SECGPIO_SECPIO04_PIO0_4 IOPCTL_MUX(0, 4, 8) /* PIO0_4 */
#define ADC0_CH0_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define CTIMER0_CAPTURE0_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER0_CAPTURE1_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER0_CAPTURE2_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER0_CAPTURE3_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER1_CAPTURE0_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER1_CAPTURE1_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER1_CAPTURE2_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER1_CAPTURE3_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER2_CAPTURE0_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER2_CAPTURE1_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER2_CAPTURE2_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER2_CAPTURE3_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER3_CAPTURE0_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER3_CAPTURE1_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER3_CAPTURE2_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER3_CAPTURE3_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER4_CAPTURE0_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER4_CAPTURE1_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER4_CAPTURE2_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define CTIMER4_CAPTURE3_PIO0_5 IOPCTL_MUX(0, 5, 4) /* PIO0_5 */
#define DMA0_TRIG0_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG10_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG11_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG12_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG13_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG14_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG15_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG16_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG17_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG18_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG19_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG1_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG20_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG21_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG22_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG23_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG24_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG25_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG26_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG27_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG28_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG29_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG2_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG30_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG31_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG32_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG3_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG4_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG5_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG6_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG7_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG8_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA0_TRIG9_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG0_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG10_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG11_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG12_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG13_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG14_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG15_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG16_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG17_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG18_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG19_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG1_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG20_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG21_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG22_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG23_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG24_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG25_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG26_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG27_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG28_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG29_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG2_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG30_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG31_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG32_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG3_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG4_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG5_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG6_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG7_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG8_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define DMA1_TRIG9_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define FC0_SSEL2_PIO0_5 IOPCTL_MUX(0, 5, 1) /* PIO0_5 */
#define GPIO_PIO05_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT0_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT1_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT2_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT3_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT4_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT5_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT6_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define PINT_PINT7_PIO0_5 IOPCTL_MUX(0, 5, 0) /* PIO0_5 */
#define SCT0_IN0_PIO0_5 IOPCTL_MUX(0, 5, 2) /* PIO0_5 */
#define SCT0_IN1_PIO0_5 IOPCTL_MUX(0, 5, 2) /* PIO0_5 */
#define SCT0_IN2_PIO0_5 IOPCTL_MUX(0, 5, 2) /* PIO0_5 */
#define SCT0_IN3_PIO0_5 IOPCTL_MUX(0, 5, 2) /* PIO0_5 */
#define SCT0_IN4_PIO0_5 IOPCTL_MUX(0, 5, 2) /* PIO0_5 */
#define SCT0_IN5_PIO0_5 IOPCTL_MUX(0, 5, 2) /* PIO0_5 */
#define SCT0_IN6_PIO0_5 IOPCTL_MUX(0, 5, 2) /* PIO0_5 */
#define SCT0_OUT0_PIO0_5 IOPCTL_MUX(0, 5, 3) /* PIO0_5 */
#define SECGPIO_SECPIO05_PIO0_5 IOPCTL_MUX(0, 5, 8) /* PIO0_5 */
#define ADC0_CH8_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define CTIMER0_MATCH0_PIO0_6 IOPCTL_MUX(0, 6, 4) /* PIO0_6 */
#define DMA0_TRIG0_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG10_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG11_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG12_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG13_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG14_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG15_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG16_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG17_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG18_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG19_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG1_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG20_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG21_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG22_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG23_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG24_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG25_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG26_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG27_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG28_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG29_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG2_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG30_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG31_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG32_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG3_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG4_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG5_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG6_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG7_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG8_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA0_TRIG9_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG0_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG10_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG11_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG12_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG13_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG14_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG15_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG16_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG17_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG18_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG19_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG1_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG20_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG21_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG22_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG23_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG24_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG25_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG26_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG27_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG28_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG29_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG2_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG30_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG31_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG32_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG3_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG4_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG5_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG6_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG7_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG8_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define DMA1_TRIG9_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define FC0_SSEL3_PIO0_6 IOPCTL_MUX(0, 6, 1) /* PIO0_6 */
#define GPIO_PIO06_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT0_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT1_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT2_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT3_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT4_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT5_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT6_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define PINT_PINT7_PIO0_6 IOPCTL_MUX(0, 6, 0) /* PIO0_6 */
#define SCT0_IN0_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN1_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN2_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN3_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN4_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN5_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_IN6_PIO0_6 IOPCTL_MUX(0, 6, 2) /* PIO0_6 */
#define SCT0_OUT1_PIO0_6 IOPCTL_MUX(0, 6, 3) /* PIO0_6 */
#define SECGPIO_SECPIO06_PIO0_6 IOPCTL_MUX(0, 6, 8) /* PIO0_6 */
#define CTIMER1_MATCH0_PIO0_7 IOPCTL_MUX(0, 7, 4) /* PIO0_7 */
#define DMA0_TRIG0_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG10_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG11_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG12_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG13_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG14_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG15_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG16_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG17_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG18_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG19_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG1_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG20_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG21_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG22_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG23_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG24_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG25_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG26_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG27_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG28_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG29_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG2_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG30_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG31_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG32_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG3_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG4_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG5_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG6_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG7_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG8_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA0_TRIG9_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG0_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG10_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG11_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG12_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG13_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG14_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG15_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG16_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG17_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG18_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG19_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG1_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG20_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG21_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG22_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG23_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG24_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG25_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG26_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG27_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG28_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG29_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG2_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG30_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG31_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG32_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG3_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG4_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG5_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG6_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG7_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG8_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define DMA1_TRIG9_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define FC1_SCK_PIO0_7 IOPCTL_MUX(0, 7, 1) /* PIO0_7 */
#define GPIO_PIO07_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define I2S_BRIDGE_CLK_OUT_PIO0_7 IOPCTL_MUX(0, 7, 5) /* PIO0_7 */
#define PINT_PINT0_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT_PINT1_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT_PINT2_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT_PINT3_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT_PINT4_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT_PINT5_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT_PINT6_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define PINT_PINT7_PIO0_7 IOPCTL_MUX(0, 7, 0) /* PIO0_7 */
#define SCT0_IN0_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN1_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN2_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN3_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN4_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN5_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_IN6_PIO0_7 IOPCTL_MUX(0, 7, 2) /* PIO0_7 */
#define SCT0_OUT4_PIO0_7 IOPCTL_MUX(0, 7, 3) /* PIO0_7 */
#define SECGPIO_SECPIO07_PIO0_7 IOPCTL_MUX(0, 7, 8) /* PIO0_7 */
#define CTIMER1_MATCH1_PIO0_8 IOPCTL_MUX(0, 8, 4) /* PIO0_8 */
#define DMA0_TRIG0_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG10_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG11_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG12_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG13_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG14_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG15_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG16_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG17_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG18_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG19_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG1_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG20_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG21_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG22_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG23_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG24_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG25_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG26_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG27_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG28_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG29_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG2_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG30_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG31_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG32_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG3_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG4_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG5_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG6_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG7_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG8_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA0_TRIG9_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG0_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG10_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG11_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG12_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG13_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG14_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG15_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG16_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG17_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG18_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG19_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG1_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG20_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG21_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG22_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG23_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG24_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG25_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG26_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG27_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG28_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG29_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG2_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG30_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG31_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG32_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG3_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG4_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG5_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG6_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG7_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG8_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define DMA1_TRIG9_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define FC1_TXD_SCL_MISO_WS_PIO0_8 IOPCTL_MUX(0, 8, 1) /* PIO0_8 */
#define GPIO_PIO08_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define I2S_BRIDGE_WS_OUT_PIO0_8 IOPCTL_MUX(0, 8, 5) /* PIO0_8 */
#define PINT_PINT0_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define PINT_PINT1_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define PINT_PINT2_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define PINT_PINT3_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define PINT_PINT4_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define PINT_PINT5_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define PINT_PINT6_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define PINT_PINT7_PIO0_8 IOPCTL_MUX(0, 8, 0) /* PIO0_8 */
#define SCT0_IN0_PIO0_8 IOPCTL_MUX(0, 8, 2) /* PIO0_8 */
#define SCT0_IN1_PIO0_8 IOPCTL_MUX(0, 8, 2) /* PIO0_8 */
#define SCT0_IN2_PIO0_8 IOPCTL_MUX(0, 8, 2) /* PIO0_8 */
#define SCT0_IN3_PIO0_8 IOPCTL_MUX(0, 8, 2) /* PIO0_8 */
#define SCT0_IN4_PIO0_8 IOPCTL_MUX(0, 8, 2) /* PIO0_8 */
#define SCT0_IN5_PIO0_8 IOPCTL_MUX(0, 8, 2) /* PIO0_8 */
#define SCT0_IN6_PIO0_8 IOPCTL_MUX(0, 8, 2) /* PIO0_8 */
#define SCT0_OUT5_PIO0_8 IOPCTL_MUX(0, 8, 3) /* PIO0_8 */
#define SECGPIO_SECPIO08_PIO0_8 IOPCTL_MUX(0, 8, 8) /* PIO0_8 */
#define CTIMER1_MATCH2_PIO0_9 IOPCTL_MUX(0, 9, 4) /* PIO0_9 */
#define DMA0_TRIG0_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG10_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG11_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG12_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG13_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG14_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG15_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG16_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
