zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG17_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG18_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG19_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG1_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG20_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG21_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG22_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG23_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG24_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG25_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG26_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG27_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG28_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG29_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG2_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG30_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG31_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG32_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG3_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG4_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG5_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG6_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG7_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG8_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA0_TRIG9_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG0_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG10_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG11_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG12_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG13_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG14_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG15_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG16_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG17_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG18_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG19_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG1_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG20_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG21_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG22_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG23_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG24_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG25_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG26_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG27_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG28_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG29_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG2_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG30_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG31_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG32_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG3_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG4_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG5_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG6_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG7_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG8_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define DMA1_TRIG9_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define FC1_RXD_SDA_MOSI_DATA_PIO0_9 IOPCTL_MUX(0, 9, 1) /* PIO0_9 */
#define GPIO_PIO09_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define I2S_BRIDGE_DATA_OUT_PIO0_9 IOPCTL_MUX(0, 9, 5) /* PIO0_9 */
#define PINT_PINT0_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define PINT_PINT1_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define PINT_PINT2_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define PINT_PINT3_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define PINT_PINT4_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define PINT_PINT5_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define PINT_PINT6_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define PINT_PINT7_PIO0_9 IOPCTL_MUX(0, 9, 0) /* PIO0_9 */
#define SCT0_IN0_PIO0_9 IOPCTL_MUX(0, 9, 2) /* PIO0_9 */
#define SCT0_IN1_PIO0_9 IOPCTL_MUX(0, 9, 2) /* PIO0_9 */
#define SCT0_IN2_PIO0_9 IOPCTL_MUX(0, 9, 2) /* PIO0_9 */
#define SCT0_IN3_PIO0_9 IOPCTL_MUX(0, 9, 2) /* PIO0_9 */
#define SCT0_IN4_PIO0_9 IOPCTL_MUX(0, 9, 2) /* PIO0_9 */
#define SCT0_IN5_PIO0_9 IOPCTL_MUX(0, 9, 2) /* PIO0_9 */
#define SCT0_IN6_PIO0_9 IOPCTL_MUX(0, 9, 2) /* PIO0_9 */
#define SCT0_OUT6_PIO0_9 IOPCTL_MUX(0, 9, 3) /* PIO0_9 */
#define SECGPIO_SECPIO09_PIO0_9 IOPCTL_MUX(0, 9, 8) /* PIO0_9 */
#define CTIMER1_MATCH3_PIO0_10 IOPCTL_MUX(0, 10, 4) /* PIO0_10 */
#define DMA0_TRIG0_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG10_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG11_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG12_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG13_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG14_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG15_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG16_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG17_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG18_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG19_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG1_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG20_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG21_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG22_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG23_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG24_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG25_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG26_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG27_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG28_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG29_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG2_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG30_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG31_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG32_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG3_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG4_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG5_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG6_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG7_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG8_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA0_TRIG9_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG0_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG10_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG11_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG12_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG13_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG14_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG15_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG16_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG17_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG18_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG19_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG1_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG20_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG21_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG22_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG23_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG24_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG25_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG26_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG27_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG28_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG29_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG2_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG30_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG31_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG32_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG3_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG4_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG5_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG6_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG7_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG8_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define DMA1_TRIG9_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define FC0_SSEL2_PIO0_10 IOPCTL_MUX(0, 10, 5) /* PIO0_10 */
#define FC1_CTS_SDA_SSEL0_PIO0_10 IOPCTL_MUX(0, 10, 1) /* PIO0_10 */
#define GPIO_PIO010_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT0_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT1_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT2_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT3_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT4_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT5_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT6_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define PINT_PINT7_PIO0_10 IOPCTL_MUX(0, 10, 0) /* PIO0_10 */
#define SCT0_IN0_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN1_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN2_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN3_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN4_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN5_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_IN6_PIO0_10 IOPCTL_MUX(0, 10, 2) /* PIO0_10 */
#define SCT0_OUT7_PIO0_10 IOPCTL_MUX(0, 10, 3) /* PIO0_10 */
#define SECGPIO_SECPIO010_PIO0_10 IOPCTL_MUX(0, 10, 8) /* PIO0_10 */
#define CTIMER0_CAPTURE0_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER0_CAPTURE1_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER0_CAPTURE2_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER0_CAPTURE3_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER1_CAPTURE0_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER1_CAPTURE1_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER1_CAPTURE2_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER1_CAPTURE3_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER2_CAPTURE0_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER2_CAPTURE1_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER2_CAPTURE2_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER2_CAPTURE3_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER3_CAPTURE0_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER3_CAPTURE1_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER3_CAPTURE2_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER3_CAPTURE3_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER4_CAPTURE0_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER4_CAPTURE1_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER4_CAPTURE2_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define CTIMER4_CAPTURE3_PIO0_11 IOPCTL_MUX(0, 11, 4) /* PIO0_11 */
#define DMA0_TRIG0_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG10_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG11_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG12_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG13_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG14_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG15_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG16_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG17_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG18_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG19_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG1_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG20_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG21_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG22_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG23_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG24_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG25_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG26_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG27_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG28_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG29_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG2_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG30_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG31_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG32_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG3_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG4_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG5_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG6_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG7_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG8_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA0_TRIG9_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG0_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG10_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG11_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG12_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG13_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG14_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG15_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG16_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG17_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG18_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG19_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG1_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG20_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG21_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG22_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG23_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG24_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG25_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG26_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG27_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG28_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG29_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG2_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG30_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG31_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG32_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG3_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG4_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG5_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG6_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG7_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG8_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define DMA1_TRIG9_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define FC0_SSEL3_PIO0_11 IOPCTL_MUX(0, 11, 5) /* PIO0_11 */
#define FC1_RTS_SCL_SSEL1_PIO0_11 IOPCTL_MUX(0, 11, 1) /* PIO0_11 */
#define GPIO_PIO011_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT0_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT1_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT2_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT3_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT4_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT5_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT6_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define PINT_PINT7_PIO0_11 IOPCTL_MUX(0, 11, 0) /* PIO0_11 */
#define SCT0_IN0_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN1_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN2_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN3_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN4_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN5_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_IN6_PIO0_11 IOPCTL_MUX(0, 11, 2) /* PIO0_11 */
#define SCT0_OUT8_PIO0_11 IOPCTL_MUX(0, 11, 3) /* PIO0_11 */
#define SECGPIO_SECPIO011_PIO0_11 IOPCTL_MUX(0, 11, 8) /* PIO0_11 */
#define ADC0_CH1_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define CTIMER0_CAPTURE0_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER0_CAPTURE1_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER0_CAPTURE2_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER0_CAPTURE3_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER1_CAPTURE0_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER1_CAPTURE1_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER1_CAPTURE2_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER1_CAPTURE3_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER2_CAPTURE0_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER2_CAPTURE1_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER2_CAPTURE2_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER2_CAPTURE3_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER3_CAPTURE0_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER3_CAPTURE1_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER3_CAPTURE2_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER3_CAPTURE3_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER4_CAPTURE0_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER4_CAPTURE1_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER4_CAPTURE2_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define CTIMER4_CAPTURE3_PIO0_12 IOPCTL_MUX(0, 12, 4) /* PIO0_12 */
#define DMA0_TRIG0_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG10_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG11_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG12_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG13_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG14_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG15_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG16_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG17_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG18_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG19_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG1_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG20_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG21_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG22_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG23_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG24_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG25_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG26_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG27_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG28_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG29_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG2_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG30_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG31_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG32_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG3_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG4_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG5_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG6_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG7_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG8_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA0_TRIG9_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG0_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG10_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG11_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG12_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG13_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG14_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG15_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG16_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG17_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG18_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG19_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG1_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG20_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG21_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG22_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG23_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG24_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG25_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG26_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG27_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG28_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG29_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG2_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG30_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG31_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG32_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG3_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG4_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG5_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG6_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG7_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG8_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define DMA1_TRIG9_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define FC1_SSEL2_PIO0_12 IOPCTL_MUX(0, 12, 1) /* PIO0_12 */
#define GPIO_PIO012_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT0_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT1_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT2_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT3_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT4_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT5_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT6_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define PINT_PINT7_PIO0_12 IOPCTL_MUX(0, 12, 0) /* PIO0_12 */
#define SCT0_IN0_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN1_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN2_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN3_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN4_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN5_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_IN6_PIO0_12 IOPCTL_MUX(0, 12, 2) /* PIO0_12 */
#define SCT0_OUT2_PIO0_12 IOPCTL_MUX(0, 12, 3) /* PIO0_12 */
#define SECGPIO_SECPIO012_PIO0_12 IOPCTL_MUX(0, 12, 8) /* PIO0_12 */
#define ADC0_CH9_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define CTIMER0_MATCH1_PIO0_13 IOPCTL_MUX(0, 13, 4) /* PIO0_13 */
#define DMA0_TRIG0_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG10_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG11_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG12_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG13_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
