zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG14_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG15_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG16_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG17_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG18_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG19_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG1_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG20_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG21_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG22_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG23_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG24_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG25_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG26_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG27_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG28_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG29_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG2_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG30_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG31_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG32_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG3_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG4_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG5_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG6_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG7_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG8_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA0_TRIG9_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG0_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG10_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG11_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG12_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG13_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG14_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG15_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG16_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG17_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG18_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG19_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG1_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG20_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG21_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG22_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG23_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG24_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG25_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG26_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG27_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG28_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG29_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG2_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG30_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG31_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG32_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG3_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG4_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG5_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG6_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG7_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG8_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define DMA1_TRIG9_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define FC1_SSEL3_PIO0_13 IOPCTL_MUX(0, 13, 1) /* PIO0_13 */
#define GPIO_PIO013_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT0_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT1_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT2_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT3_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT4_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT5_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT6_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define PINT_PINT7_PIO0_13 IOPCTL_MUX(0, 13, 0) /* PIO0_13 */
#define SCT0_IN0_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN1_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN2_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN3_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN4_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN5_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_IN6_PIO0_13 IOPCTL_MUX(0, 13, 2) /* PIO0_13 */
#define SCT0_OUT3_PIO0_13 IOPCTL_MUX(0, 13, 3) /* PIO0_13 */
#define SECGPIO_SECPIO013_PIO0_13 IOPCTL_MUX(0, 13, 8) /* PIO0_13 */
#define CTIMER2_MATCH0_PIO0_14 IOPCTL_MUX(0, 14, 4) /* PIO0_14 */
#define DMA0_TRIG0_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG10_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG11_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG12_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG13_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG14_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG15_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG16_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG17_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG18_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG19_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG1_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG20_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG21_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG22_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG23_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG24_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG25_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG26_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG27_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG28_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG29_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG2_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG30_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG31_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG32_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG3_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG4_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG5_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG6_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG7_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG8_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA0_TRIG9_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG0_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG10_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG11_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG12_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG13_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG14_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG15_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG16_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG17_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG18_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG19_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG1_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG20_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG21_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG22_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG23_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG24_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG25_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG26_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG27_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG28_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG29_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG2_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG30_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG31_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG32_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG3_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG4_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG5_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG6_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG7_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG8_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define DMA1_TRIG9_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define FC2_SCK_PIO0_14 IOPCTL_MUX(0, 14, 1) /* PIO0_14 */
#define GPIO_PIO014_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define I2S_BRIDGE_CLK_IN_PIO0_14 IOPCTL_MUX(0, 14, 5) /* PIO0_14 */
#define PINT_PINT0_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT_PINT1_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT_PINT2_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT_PINT3_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT_PINT4_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT_PINT5_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT_PINT6_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT_PINT7_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define SCT0_IN0_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN1_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN2_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN3_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN4_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN5_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN6_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_OUT0_PIO0_14 IOPCTL_MUX(0, 14, 3) /* PIO0_14 */
#define SECGPIO_SECPIO014_PIO0_14 IOPCTL_MUX(0, 14, 8) /* PIO0_14 */
#define CTIMER2_MATCH1_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define DMA0_TRIG0_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG10_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG11_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG12_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG13_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG14_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG15_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG16_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG17_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG18_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG19_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG1_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG20_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG21_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG22_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG23_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG24_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG25_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG26_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG27_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG28_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG29_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG2_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG30_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG31_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG32_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG3_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG4_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG5_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG6_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG7_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG8_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA0_TRIG9_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG0_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG10_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG11_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG12_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG13_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG14_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG15_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG16_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG17_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG18_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG19_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG1_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG20_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG21_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG22_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG23_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG24_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG25_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG26_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG27_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG28_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG29_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG2_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG30_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG31_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG32_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG3_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG4_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG5_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG6_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG7_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG8_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define DMA1_TRIG9_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define FC2_TXD_SCL_MISO_WS_PIO0_15 IOPCTL_MUX(0, 15, 1) /* PIO0_15 */
#define GPIO_PIO015_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define I2S_BRIDGE_WS_IN_PIO0_15 IOPCTL_MUX(0, 15, 5) /* PIO0_15 */
#define PINT_PINT0_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT_PINT1_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT_PINT2_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT_PINT3_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT_PINT4_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT_PINT5_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT_PINT6_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT_PINT7_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define SCT0_IN0_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN1_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN2_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN3_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN4_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN5_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN6_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_OUT1_PIO0_15 IOPCTL_MUX(0, 15, 3) /* PIO0_15 */
#define SECGPIO_SECPIO015_PIO0_15 IOPCTL_MUX(0, 15, 8) /* PIO0_15 */
#define CTIMER2_MATCH2_PIO0_16 IOPCTL_MUX(0, 16, 4) /* PIO0_16 */
#define DMA0_TRIG0_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG10_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG11_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG12_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG13_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG14_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG15_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG16_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG17_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG18_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG19_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG1_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG20_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG21_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG22_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG23_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG24_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG25_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG26_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG27_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG28_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG29_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG2_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG30_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG31_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG32_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG3_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG4_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG5_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG6_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG7_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG8_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA0_TRIG9_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG0_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG10_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG11_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG12_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG13_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG14_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG15_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG16_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG17_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG18_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG19_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG1_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG20_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG21_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG22_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG23_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG24_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG25_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG26_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG27_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG28_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG29_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG2_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG30_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG31_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG32_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG3_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG4_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG5_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG6_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG7_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG8_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define DMA1_TRIG9_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define FC2_RXD_SDA_MOSI_DATA_PIO0_16 IOPCTL_MUX(0, 16, 1) /* PIO0_16 */
#define GPIO_PIO016_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define I2S_BRIDGE_DATA_IN_PIO0_16 IOPCTL_MUX(0, 16, 5) /* PIO0_16 */
#define PINT_PINT0_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT_PINT1_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT_PINT2_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT_PINT3_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT_PINT4_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT_PINT5_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT_PINT6_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT_PINT7_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define SCT0_IN0_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN1_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN2_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN3_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN4_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN5_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN6_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_OUT2_PIO0_16 IOPCTL_MUX(0, 16, 3) /* PIO0_16 */
#define SECGPIO_SECPIO016_PIO0_16 IOPCTL_MUX(0, 16, 8) /* PIO0_16 */
#define CTIMER2_MATCH3_PIO0_17 IOPCTL_MUX(0, 17, 4) /* PIO0_17 */
#define DMA0_TRIG0_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG10_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG11_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG12_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG13_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG14_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG15_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG16_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG17_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG18_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG19_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG1_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG20_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG21_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG22_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG23_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG24_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG25_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG26_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG27_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG28_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG29_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG2_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG30_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG31_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG32_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG3_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG4_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG5_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG6_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG7_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG8_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA0_TRIG9_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG0_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG10_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG11_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG12_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG13_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG14_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG15_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG16_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
