zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA1_TRIG17_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG18_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG19_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG1_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG20_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG21_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG22_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG23_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG24_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG25_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG26_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG27_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG28_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG29_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG2_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG30_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG31_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG32_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG3_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG4_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG5_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG6_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG7_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG8_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define DMA1_TRIG9_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define FC2_CTS_SDA_SSEL0_PIO0_17 IOPCTL_MUX(0, 17, 1) /* PIO0_17 */
#define FC5_SSEL2_PIO0_17 IOPCTL_MUX(0, 17, 5) /* PIO0_17 */
#define GPIO_PIO017_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT0_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT1_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT2_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT3_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT4_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT5_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT6_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT_PINT7_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define SCT0_IN0_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN1_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN2_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN3_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN4_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN5_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN6_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_OUT3_PIO0_17 IOPCTL_MUX(0, 17, 3) /* PIO0_17 */
#define SECGPIO_SECPIO017_PIO0_17 IOPCTL_MUX(0, 17, 8) /* PIO0_17 */
#define CTIMER0_CAPTURE0_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER0_CAPTURE1_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER0_CAPTURE2_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER0_CAPTURE3_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER1_CAPTURE0_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER1_CAPTURE1_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER1_CAPTURE2_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER1_CAPTURE3_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER2_CAPTURE0_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER2_CAPTURE1_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER2_CAPTURE2_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER2_CAPTURE3_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER3_CAPTURE0_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER3_CAPTURE1_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER3_CAPTURE2_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER3_CAPTURE3_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER4_CAPTURE0_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER4_CAPTURE1_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER4_CAPTURE2_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define CTIMER4_CAPTURE3_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define DMA0_TRIG0_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG10_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG11_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG12_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG13_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG14_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG15_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG16_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG17_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG18_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG19_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG1_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG20_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG21_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG22_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG23_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG24_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG25_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG26_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG27_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG28_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG29_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG2_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG30_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG31_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG32_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG3_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG4_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG5_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG6_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG7_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG8_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA0_TRIG9_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG0_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG10_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG11_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG12_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG13_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG14_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG15_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG16_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG17_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG18_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG19_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG1_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG20_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG21_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG22_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG23_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG24_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG25_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG26_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG27_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG28_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG29_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG2_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG30_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG31_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG32_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG3_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG4_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG5_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG6_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG7_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG8_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define DMA1_TRIG9_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define FC2_RTS_SCL_SSEL1_PIO0_18 IOPCTL_MUX(0, 18, 1) /* PIO0_18 */
#define FC5_SSEL3_PIO0_18 IOPCTL_MUX(0, 18, 5) /* PIO0_18 */
#define GPIO_PIO018_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT0_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT1_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT2_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT3_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT4_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT5_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT6_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT_PINT7_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define SCT0_IN0_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN1_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN2_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN3_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN4_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN5_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN6_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_OUT6_PIO0_18 IOPCTL_MUX(0, 18, 3) /* PIO0_18 */
#define SECGPIO_SECPIO018_PIO0_18 IOPCTL_MUX(0, 18, 8) /* PIO0_18 */
#define ADC0_CH2_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define CTIMER0_CAPTURE0_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER0_CAPTURE1_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER0_CAPTURE2_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER0_CAPTURE3_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER1_CAPTURE0_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER1_CAPTURE1_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER1_CAPTURE2_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER1_CAPTURE3_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER2_CAPTURE0_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER2_CAPTURE1_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER2_CAPTURE2_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER2_CAPTURE3_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER3_CAPTURE0_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER3_CAPTURE1_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER3_CAPTURE2_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER3_CAPTURE3_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER4_CAPTURE0_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER4_CAPTURE1_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER4_CAPTURE2_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define CTIMER4_CAPTURE3_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define DMA0_TRIG0_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG10_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG11_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG12_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG13_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG14_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG15_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG16_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG17_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG18_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG19_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG1_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG20_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG21_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG22_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG23_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG24_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG25_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG26_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG27_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG28_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG29_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG2_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG30_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG31_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG32_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG3_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG4_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG5_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG6_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG7_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG8_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA0_TRIG9_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG0_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG10_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG11_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG12_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG13_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG14_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG15_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG16_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG17_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG18_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG19_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG1_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG20_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG21_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG22_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG23_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG24_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG25_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG26_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG27_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG28_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG29_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG2_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG30_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG31_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG32_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG3_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG4_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG5_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG6_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG7_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG8_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define DMA1_TRIG9_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define FC2_SSEL2_PIO0_19 IOPCTL_MUX(0, 19, 1) /* PIO0_19 */
#define GPIO_PIO019_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT0_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT1_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT2_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT3_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT4_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT5_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT6_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT_PINT7_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define SCT0_IN0_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN1_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN2_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN3_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN4_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN5_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN6_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_OUT4_PIO0_19 IOPCTL_MUX(0, 19, 3) /* PIO0_19 */
#define SECGPIO_SECPIO019_PIO0_19 IOPCTL_MUX(0, 19, 8) /* PIO0_19 */
#define UTICK0_CAPTURE0_PIO0_19 IOPCTL_MUX(0, 19, 5) /* PIO0_19 */
#define ADC0_CH10_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define CTIMER0_CAPTURE0_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER0_CAPTURE1_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER0_CAPTURE2_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER0_CAPTURE3_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER0_MATCH2_PIO0_20 IOPCTL_MUX(0, 20, 4) /* PIO0_20 */
#define CTIMER1_CAPTURE0_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER1_CAPTURE1_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER1_CAPTURE2_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER1_CAPTURE3_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER2_CAPTURE0_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER2_CAPTURE1_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER2_CAPTURE2_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER2_CAPTURE3_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER3_CAPTURE0_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER3_CAPTURE1_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER3_CAPTURE2_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER3_CAPTURE3_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER4_CAPTURE0_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER4_CAPTURE1_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER4_CAPTURE2_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define CTIMER4_CAPTURE3_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define DMA0_TRIG0_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG10_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG11_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG12_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG13_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG14_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG15_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG16_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG17_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG18_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG19_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG1_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG20_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG21_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG22_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG23_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG24_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG25_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG26_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG27_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG28_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG29_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG2_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG30_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG31_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG32_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG3_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG4_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG5_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG6_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG7_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG8_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA0_TRIG9_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG0_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG10_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG11_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG12_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG13_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG14_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG15_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG16_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG17_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG18_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG19_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG1_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG20_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG21_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG22_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG23_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG24_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG25_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG26_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG27_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG28_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG29_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG2_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG30_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG31_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG32_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG3_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG4_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG5_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG6_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG7_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG8_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define DMA1_TRIG9_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define FC2_SSEL3_PIO0_20 IOPCTL_MUX(0, 20, 1) /* PIO0_20 */
#define GPIO_PIO020_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT0_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT1_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT2_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT3_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT4_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT5_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT6_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT_PINT7_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define SCT0_IN0_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN1_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN2_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN3_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN4_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN5_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN6_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_OUT5_PIO0_20 IOPCTL_MUX(0, 20, 3) /* PIO0_20 */
#define SECGPIO_SECPIO020_PIO0_20 IOPCTL_MUX(0, 20, 8) /* PIO0_20 */
#define CTIMER3_MATCH0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define DMA0_TRIG0_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG10_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG11_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG12_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG13_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG14_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG15_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG16_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG17_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG18_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG19_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG1_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
