zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG20_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG21_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG22_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG23_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG24_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG25_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG26_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG27_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG28_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG29_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG2_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG30_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG31_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG32_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG3_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG4_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG5_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG6_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG7_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG8_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA0_TRIG9_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG0_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG10_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG11_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG12_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG13_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG14_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG15_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG16_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG17_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG18_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG19_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG1_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG20_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG21_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG22_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG23_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG24_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG25_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG26_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG27_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG28_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG29_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG2_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG30_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG31_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG32_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG3_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG4_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG5_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG6_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG7_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG8_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define DMA1_TRIG9_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define FC3_SCK_PIO0_21 IOPCTL_MUX(0, 21, 1) /* PIO0_21 */
#define GPIO_PIO021_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT0_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT1_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT2_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT3_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT4_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT5_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT6_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT_PINT7_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define SECGPIO_SECPIO021_PIO0_21 IOPCTL_MUX(0, 21, 8) /* PIO0_21 */
#define TRACECLK_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define CTIMER3_MATCH1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define DMA0_TRIG0_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG10_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG11_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG12_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG13_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG14_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG15_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG16_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG17_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG18_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG19_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG1_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG20_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG21_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG22_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG23_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG24_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG25_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG26_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG27_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG28_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG29_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG2_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG30_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG31_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG32_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG3_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG4_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG5_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG6_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG7_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG8_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA0_TRIG9_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG0_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG10_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG11_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG12_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG13_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG14_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG15_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG16_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG17_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG18_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG19_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG1_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG20_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG21_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG22_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG23_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG24_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG25_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG26_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG27_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG28_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG29_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG2_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG30_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG31_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG32_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG3_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG4_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG5_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG6_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG7_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG8_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define DMA1_TRIG9_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define FC3_TXD_SCL_MISO_WS_PIO0_22 IOPCTL_MUX(0, 22, 1) /* PIO0_22 */
#define GPIO_PIO022_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT0_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT1_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT2_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT3_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT4_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT5_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT6_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT_PINT7_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define SECGPIO_SECPIO022_PIO0_22 IOPCTL_MUX(0, 22, 8) /* PIO0_22 */
#define SWD_TRACEDATA0_PIO0_22 IOPCTL_MUX(0, 22, 6) /* PIO0_22 */
#define CTIMER3_MATCH2_PIO0_23 IOPCTL_MUX(0, 23, 4) /* PIO0_23 */
#define DMA0_TRIG0_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG10_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG11_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG12_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG13_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG14_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG15_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG16_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG17_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG18_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG19_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG1_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG20_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG21_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG22_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG23_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG24_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG25_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG26_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG27_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG28_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG29_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG2_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG30_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG31_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG32_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG3_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG4_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG5_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG6_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG7_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG8_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA0_TRIG9_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG0_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG10_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG11_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG12_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG13_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG14_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG15_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG16_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG17_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG18_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG19_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG1_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG20_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG21_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG22_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG23_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG24_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG25_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG26_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG27_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG28_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG29_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG2_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG30_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG31_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG32_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG3_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG4_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG5_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG6_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG7_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG8_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define DMA1_TRIG9_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define FC3_RXD_SDA_MOSI_DATA_PIO0_23 IOPCTL_MUX(0, 23, 1) /* PIO0_23 */
#define GPIO_PIO023_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT0_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT1_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT2_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT3_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT4_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT5_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT6_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define PINT_PINT7_PIO0_23 IOPCTL_MUX(0, 23, 0) /* PIO0_23 */
#define SECGPIO_SECPIO023_PIO0_23 IOPCTL_MUX(0, 23, 8) /* PIO0_23 */
#define SWD_TRACEDATA1_PIO0_23 IOPCTL_MUX(0, 23, 6) /* PIO0_23 */
#define CLKOUT_PIO0_24 IOPCTL_MUX(0, 24, 7) /* PIO0_24 */
#define CTIMER3_MATCH3_PIO0_24 IOPCTL_MUX(0, 24, 4) /* PIO0_24 */
#define DMA0_TRIG0_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG10_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG11_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG12_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG13_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG14_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG15_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG16_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG17_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG18_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG19_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG1_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG20_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG21_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG22_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG23_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG24_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG25_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG26_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG27_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG28_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG29_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG2_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG30_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG31_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG32_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG3_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG4_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG5_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG6_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG7_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG8_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA0_TRIG9_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG0_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG10_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG11_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG12_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG13_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG14_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG15_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG16_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG17_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG18_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG19_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG1_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG20_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG21_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG22_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG23_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG24_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG25_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG26_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG27_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG28_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG29_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG2_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG30_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG31_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG32_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG3_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG4_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG5_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG6_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG7_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG8_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define DMA1_TRIG9_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define FC2_SSEL2_PIO0_24 IOPCTL_MUX(0, 24, 5) /* PIO0_24 */
#define FC3_CTS_SDA_SSEL0_PIO0_24 IOPCTL_MUX(0, 24, 1) /* PIO0_24 */
#define GPIO_PIO024_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT0_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT1_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT2_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT3_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT4_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT5_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT6_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define PINT_PINT7_PIO0_24 IOPCTL_MUX(0, 24, 0) /* PIO0_24 */
#define SECGPIO_SECPIO024_PIO0_24 IOPCTL_MUX(0, 24, 8) /* PIO0_24 */
#define SWD_TRACEDATA2_PIO0_24 IOPCTL_MUX(0, 24, 6) /* PIO0_24 */
#define CLKIN_PIO0_25 IOPCTL_MUX(0, 25, 7) /* PIO0_25 */
#define CTIMER0_CAPTURE0_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER0_CAPTURE1_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER0_CAPTURE2_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER0_CAPTURE3_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER1_CAPTURE0_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER1_CAPTURE1_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER1_CAPTURE2_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER1_CAPTURE3_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER2_CAPTURE0_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER2_CAPTURE1_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER2_CAPTURE2_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER2_CAPTURE3_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER3_CAPTURE0_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER3_CAPTURE1_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER3_CAPTURE2_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER3_CAPTURE3_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER4_CAPTURE0_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER4_CAPTURE1_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER4_CAPTURE2_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define CTIMER4_CAPTURE3_PIO0_25 IOPCTL_MUX(0, 25, 4) /* PIO0_25 */
#define DMA0_TRIG0_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG10_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG11_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG12_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG13_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG14_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG15_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG16_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG17_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG18_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG19_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG1_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG20_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG21_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG22_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG23_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG24_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG25_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG26_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG27_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG28_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG29_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG2_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG30_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG31_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG32_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG3_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG4_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG5_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG6_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG7_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG8_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA0_TRIG9_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG0_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG10_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG11_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG12_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG13_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG14_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG15_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG16_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG17_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG18_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG19_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG1_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG20_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG21_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG22_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG23_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG24_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG25_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG26_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG27_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG28_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
