zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA1_TRIG29_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG2_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG30_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG31_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG32_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG3_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG4_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG5_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG6_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG7_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG8_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define DMA1_TRIG9_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define FC2_SSEL3_PIO0_25 IOPCTL_MUX(0, 25, 5) /* PIO0_25 */
#define FC3_RTS_SCL_SSEL1_PIO0_25 IOPCTL_MUX(0, 25, 1) /* PIO0_25 */
#define FREQME_IN0_PIO0_25 IOPCTL_MUX(0, 25, 3) /* PIO0_25 */
#define FREQME_IN1_PIO0_25 IOPCTL_MUX(0, 25, 3) /* PIO0_25 */
#define GPIO_PIO025_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT0_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT1_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT2_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT3_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT4_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT5_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT6_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define PINT_PINT7_PIO0_25 IOPCTL_MUX(0, 25, 0) /* PIO0_25 */
#define SECGPIO_SECPIO025_PIO0_25 IOPCTL_MUX(0, 25, 8) /* PIO0_25 */
#define SWD_TRACEDATA3_PIO0_25 IOPCTL_MUX(0, 25, 6) /* PIO0_25 */
#define ADC0_CH3_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define CTIMER0_CAPTURE0_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER0_CAPTURE1_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER0_CAPTURE2_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER0_CAPTURE3_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER1_CAPTURE0_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER1_CAPTURE1_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER1_CAPTURE2_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER1_CAPTURE3_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER2_CAPTURE0_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER2_CAPTURE1_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER2_CAPTURE2_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER2_CAPTURE3_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER3_CAPTURE0_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER3_CAPTURE1_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER3_CAPTURE2_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER3_CAPTURE3_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER4_CAPTURE0_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER4_CAPTURE1_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER4_CAPTURE2_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define CTIMER4_CAPTURE3_PIO0_26 IOPCTL_MUX(0, 26, 4) /* PIO0_26 */
#define DMA0_TRIG0_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG10_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG11_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG12_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG13_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG14_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG15_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG16_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG17_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG18_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG19_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG1_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG20_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG21_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG22_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG23_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG24_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG25_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG26_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG27_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG28_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG29_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG2_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG30_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG31_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG32_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG3_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG4_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG5_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG6_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG7_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG8_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA0_TRIG9_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG0_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG10_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG11_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG12_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG13_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG14_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG15_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG16_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG17_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG18_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG19_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG1_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG20_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG21_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG22_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG23_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG24_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG25_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG26_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG27_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG28_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG29_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG2_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG30_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG31_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG32_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG3_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG4_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG5_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG6_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG7_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG8_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define DMA1_TRIG9_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define FC3_SSEL2_PIO0_26 IOPCTL_MUX(0, 26, 1) /* PIO0_26 */
#define GPIO_PIO026_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT0_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT1_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT2_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT3_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT4_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT5_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT6_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define PINT_PINT7_PIO0_26 IOPCTL_MUX(0, 26, 0) /* PIO0_26 */
#define SCT0_IN0_PIO0_26 IOPCTL_MUX(0, 26, 2) /* PIO0_26 */
#define SCT0_IN1_PIO0_26 IOPCTL_MUX(0, 26, 2) /* PIO0_26 */
#define SCT0_IN2_PIO0_26 IOPCTL_MUX(0, 26, 2) /* PIO0_26 */
#define SCT0_IN3_PIO0_26 IOPCTL_MUX(0, 26, 2) /* PIO0_26 */
#define SCT0_IN4_PIO0_26 IOPCTL_MUX(0, 26, 2) /* PIO0_26 */
#define SCT0_IN5_PIO0_26 IOPCTL_MUX(0, 26, 2) /* PIO0_26 */
#define SCT0_IN6_PIO0_26 IOPCTL_MUX(0, 26, 2) /* PIO0_26 */
#define SCT0_OUT6_PIO0_26 IOPCTL_MUX(0, 26, 3) /* PIO0_26 */
#define SECGPIO_SECPIO026_PIO0_26 IOPCTL_MUX(0, 26, 8) /* PIO0_26 */
#define ADC0_CH11_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define CTIMER0_MATCH3_PIO0_27 IOPCTL_MUX(0, 27, 4) /* PIO0_27 */
#define DMA0_TRIG0_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG10_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG11_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG12_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG13_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG14_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG15_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG16_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG17_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG18_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG19_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG1_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG20_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG21_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG22_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG23_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG24_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG25_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG26_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG27_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG28_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG29_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG2_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG30_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG31_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG32_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG3_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG4_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG5_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG6_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG7_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG8_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA0_TRIG9_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG0_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG10_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG11_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG12_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG13_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG14_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG15_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG16_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG17_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG18_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG19_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG1_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG20_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG21_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG22_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG23_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG24_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG25_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG26_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG27_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG28_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG29_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG2_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG30_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG31_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG32_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG3_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG4_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG5_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG6_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG7_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG8_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define DMA1_TRIG9_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define FC3_SSEL3_PIO0_27 IOPCTL_MUX(0, 27, 1) /* PIO0_27 */
#define GPIO_PIO027_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT0_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT1_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT2_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT3_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT4_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT5_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT6_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define PINT_PINT7_PIO0_27 IOPCTL_MUX(0, 27, 0) /* PIO0_27 */
#define SCT0_IN0_PIO0_27 IOPCTL_MUX(0, 27, 2) /* PIO0_27 */
#define SCT0_IN1_PIO0_27 IOPCTL_MUX(0, 27, 2) /* PIO0_27 */
#define SCT0_IN2_PIO0_27 IOPCTL_MUX(0, 27, 2) /* PIO0_27 */
#define SCT0_IN3_PIO0_27 IOPCTL_MUX(0, 27, 2) /* PIO0_27 */
#define SCT0_IN4_PIO0_27 IOPCTL_MUX(0, 27, 2) /* PIO0_27 */
#define SCT0_IN5_PIO0_27 IOPCTL_MUX(0, 27, 2) /* PIO0_27 */
#define SCT0_IN6_PIO0_27 IOPCTL_MUX(0, 27, 2) /* PIO0_27 */
#define SCT0_OUT7_PIO0_27 IOPCTL_MUX(0, 27, 3) /* PIO0_27 */
#define SECGPIO_SECPIO027_PIO0_27 IOPCTL_MUX(0, 27, 8) /* PIO0_27 */
#define CTIMER4_MATCH0_PIO0_28 IOPCTL_MUX(0, 28, 4) /* PIO0_28 */
#define DMA0_TRIG0_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG10_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG11_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG12_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG13_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG14_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG15_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG16_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG17_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG18_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG19_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG1_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG20_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG21_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG22_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG23_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG24_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG25_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG26_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG27_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG28_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG29_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG2_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG30_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG31_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG32_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG3_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG4_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG5_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG6_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG7_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG8_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA0_TRIG9_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG0_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG10_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG11_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG12_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG13_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG14_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG15_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG16_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG17_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG18_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG19_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG1_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG20_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG21_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG22_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG23_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG24_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG25_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG26_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG27_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG28_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG29_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG2_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG30_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG31_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG32_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG3_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG4_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG5_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG6_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG7_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG8_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define DMA1_TRIG9_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define FC4_SCK_PIO0_28 IOPCTL_MUX(0, 28, 1) /* PIO0_28 */
#define GPIO_PIO028_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define I2S_BRIDGE_CLK_OUT_PIO0_28 IOPCTL_MUX(0, 28, 5) /* PIO0_28 */
#define PINT_PINT0_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define PINT_PINT1_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define PINT_PINT2_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define PINT_PINT3_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define PINT_PINT4_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define PINT_PINT5_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define PINT_PINT6_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define PINT_PINT7_PIO0_28 IOPCTL_MUX(0, 28, 0) /* PIO0_28 */
#define SECGPIO_SECPIO028_PIO0_28 IOPCTL_MUX(0, 28, 8) /* PIO0_28 */
#define CTIMER4_MATCH1_PIO0_29 IOPCTL_MUX(0, 29, 4) /* PIO0_29 */
#define DMA0_TRIG0_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG10_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG11_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG12_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG13_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG14_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG15_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG16_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG17_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG18_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG19_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG1_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG20_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG21_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG22_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG23_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG24_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG25_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG26_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG27_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG28_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG29_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG2_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG30_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG31_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG32_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG3_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG4_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG5_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG6_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG7_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG8_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA0_TRIG9_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG0_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG10_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG11_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG12_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG13_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG14_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG15_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG16_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG17_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG18_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG19_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG1_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG20_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG21_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG22_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG23_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG24_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG25_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG26_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG27_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG28_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG29_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG2_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG30_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG31_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG32_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG3_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG4_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG5_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG6_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG7_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG8_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define DMA1_TRIG9_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define FC4_TXD_SCL_MISO_WS_PIO0_29 IOPCTL_MUX(0, 29, 1) /* PIO0_29 */
#define GPIO_PIO029_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define I2S_BRIDGE_WS_OUT_PIO0_29 IOPCTL_MUX(0, 29, 5) /* PIO0_29 */
#define PINT_PINT0_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define PINT_PINT1_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define PINT_PINT2_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define PINT_PINT3_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define PINT_PINT4_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define PINT_PINT5_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define PINT_PINT6_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define PINT_PINT7_PIO0_29 IOPCTL_MUX(0, 29, 0) /* PIO0_29 */
#define SECGPIO_SECPIO029_PIO0_29 IOPCTL_MUX(0, 29, 8) /* PIO0_29 */
#define CTIMER4_MATCH2_PIO0_30 IOPCTL_MUX(0, 30, 4) /* PIO0_30 */
#define DMA0_TRIG0_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG10_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
