zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG11_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG12_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG13_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG14_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG15_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG16_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG17_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG18_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG19_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG1_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG20_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG21_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG22_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG23_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG24_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG25_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG26_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG27_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG28_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG29_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG2_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG30_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG31_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG32_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG3_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG4_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG5_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG6_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG7_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG8_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA0_TRIG9_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG0_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG10_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG11_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG12_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG13_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG14_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG15_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG16_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG17_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG18_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG19_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG1_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG20_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG21_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG22_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG23_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG24_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG25_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG26_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG27_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG28_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG29_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG2_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG30_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG31_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG32_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG3_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG4_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG5_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG6_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG7_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG8_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define DMA1_TRIG9_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define FC4_RXD_SDA_MOSI_DATA_PIO0_30 IOPCTL_MUX(0, 30, 1) /* PIO0_30 */
#define GPIO_PIO030_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define I2S_BRIDGE_DATA_OUT_PIO0_30 IOPCTL_MUX(0, 30, 5) /* PIO0_30 */
#define PINT_PINT0_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define PINT_PINT1_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define PINT_PINT2_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define PINT_PINT3_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define PINT_PINT4_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define PINT_PINT5_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define PINT_PINT6_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define PINT_PINT7_PIO0_30 IOPCTL_MUX(0, 30, 0) /* PIO0_30 */
#define SECGPIO_SECPIO030_PIO0_30 IOPCTL_MUX(0, 30, 8) /* PIO0_30 */
#define CTIMER4_MATCH3_PIO0_31 IOPCTL_MUX(0, 31, 4) /* PIO0_31 */
#define DMA0_TRIG0_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG10_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG11_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG12_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG13_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG14_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG15_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG16_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG17_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG18_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG19_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG1_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG20_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG21_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG22_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG23_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG24_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG25_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG26_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG27_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG28_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG29_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG2_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG30_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG31_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG32_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG3_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG4_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG5_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG6_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG7_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG8_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA0_TRIG9_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG0_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG10_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG11_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG12_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG13_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG14_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG15_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG16_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG17_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG18_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG19_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG1_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG20_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG21_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG22_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG23_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG24_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG25_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG26_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG27_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG28_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG29_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG2_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG30_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG31_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG32_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG3_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG4_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG5_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG6_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG7_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG8_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define DMA1_TRIG9_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define FC3_SSEL2_PIO0_31 IOPCTL_MUX(0, 31, 5) /* PIO0_31 */
#define FC4_CTS_SDA_SSEL0_PIO0_31 IOPCTL_MUX(0, 31, 1) /* PIO0_31 */
#define GPIO_PIO031_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT0_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT1_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT2_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT3_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT4_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT5_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT6_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT_PINT7_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define SCT0_IN0_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define SCT0_IN1_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define SCT0_IN2_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define SCT0_IN3_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define SCT0_IN4_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define SCT0_IN5_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define SCT0_IN6_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define SCT0_OUT6_PIO0_31 IOPCTL_MUX(0, 31, 3) /* PIO0_31 */
#define SECGPIO_SECPIO031_PIO0_31 IOPCTL_MUX(0, 31, 8) /* PIO0_31 */
#define CTIMER0_CAPTURE0_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER0_CAPTURE1_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER0_CAPTURE2_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER0_CAPTURE3_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER1_CAPTURE0_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER1_CAPTURE1_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER1_CAPTURE2_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER1_CAPTURE3_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER2_CAPTURE0_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER2_CAPTURE1_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER2_CAPTURE2_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER2_CAPTURE3_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER3_CAPTURE0_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER3_CAPTURE1_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER3_CAPTURE2_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER3_CAPTURE3_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER4_CAPTURE0_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER4_CAPTURE1_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER4_CAPTURE2_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define CTIMER4_CAPTURE3_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define DMA0_TRIG0_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG10_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG11_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG12_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG13_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG14_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG15_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG16_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG17_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG18_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG19_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG1_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG20_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG21_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG22_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG23_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG24_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG25_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG26_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG27_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG28_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG29_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG2_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG30_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG31_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG32_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG3_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG4_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG5_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG6_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG7_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG8_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA0_TRIG9_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG0_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG10_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG11_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG12_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG13_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG14_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG15_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG16_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG17_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG18_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG19_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG1_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG20_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG21_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG22_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG23_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG24_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG25_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG26_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG27_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG28_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG29_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG2_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG30_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG31_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG32_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG3_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG4_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG5_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG6_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG7_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG8_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define DMA1_TRIG9_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define FC3_SSEL3_PIO1_0 IOPCTL_MUX(0, 32, 5) /* PIO1_0 */
#define FC4_RTS_SCL_SSEL1_PIO1_0 IOPCTL_MUX(0, 32, 1) /* PIO1_0 */
#define GPIO_PIO10_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT0_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT1_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT2_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT3_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT4_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT5_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT6_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT_PINT7_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define SCT0_IN0_PIO1_0 IOPCTL_MUX(0, 32, 2) /* PIO1_0 */
#define SCT0_IN1_PIO1_0 IOPCTL_MUX(0, 32, 2) /* PIO1_0 */
#define SCT0_IN2_PIO1_0 IOPCTL_MUX(0, 32, 2) /* PIO1_0 */
#define SCT0_IN3_PIO1_0 IOPCTL_MUX(0, 32, 2) /* PIO1_0 */
#define SCT0_IN4_PIO1_0 IOPCTL_MUX(0, 32, 2) /* PIO1_0 */
#define SCT0_IN5_PIO1_0 IOPCTL_MUX(0, 32, 2) /* PIO1_0 */
#define SCT0_IN6_PIO1_0 IOPCTL_MUX(0, 32, 2) /* PIO1_0 */
#define SCT0_OUT7_PIO1_0 IOPCTL_MUX(0, 32, 3) /* PIO1_0 */
#define CTIMER1_MATCH0_PIO1_1 IOPCTL_MUX(0, 33, 4) /* PIO1_1 */
#define DMA0_TRIG0_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG10_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG11_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG12_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG13_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG14_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG15_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG16_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG17_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG18_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG19_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG1_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG20_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG21_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG22_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG23_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG24_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG25_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG26_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG27_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG28_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG29_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG2_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG30_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG31_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG32_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG3_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG4_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG5_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG6_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG7_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG8_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA0_TRIG9_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG0_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG10_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG11_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG12_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG13_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG14_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG15_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG16_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG17_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG18_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG19_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG1_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG20_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG21_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG22_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG23_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG24_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG25_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG26_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG27_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG28_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG29_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG2_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG30_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG31_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG32_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG3_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG4_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG5_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG6_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG7_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG8_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define DMA1_TRIG9_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define FC4_SSEL2_PIO1_1 IOPCTL_MUX(0, 33, 1) /* PIO1_1 */
#define GPIO_PIO11_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT0_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT1_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT2_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT3_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT4_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT5_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT6_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define PINT_PINT7_PIO1_1 IOPCTL_MUX(0, 33, 0) /* PIO1_1 */
#define SCT0_IN0_PIO1_1 IOPCTL_MUX(0, 33, 2) /* PIO1_1 */
#define SCT0_IN1_PIO1_1 IOPCTL_MUX(0, 33, 2) /* PIO1_1 */
#define SCT0_IN2_PIO1_1 IOPCTL_MUX(0, 33, 2) /* PIO1_1 */
#define SCT0_IN3_PIO1_1 IOPCTL_MUX(0, 33, 2) /* PIO1_1 */
#define SCT0_IN4_PIO1_1 IOPCTL_MUX(0, 33, 2) /* PIO1_1 */
#define SCT0_IN5_PIO1_1 IOPCTL_MUX(0, 33, 2) /* PIO1_1 */
#define SCT0_IN6_PIO1_1 IOPCTL_MUX(0, 33, 2) /* PIO1_1 */
#define SCT0_OUT8_PIO1_1 IOPCTL_MUX(0, 33, 3) /* PIO1_1 */
#define CMP_IN3_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define CTIMER1_MATCH1_PIO1_2 IOPCTL_MUX(0, 34, 4) /* PIO1_2 */
#define DMA0_TRIG0_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG10_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG11_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG12_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG13_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG14_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG15_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG16_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG17_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG18_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG19_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG1_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG20_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG21_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG22_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG23_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG24_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG25_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG26_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG27_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG28_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG29_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG2_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG30_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG31_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG32_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG3_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG4_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG5_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG6_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG7_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG8_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA0_TRIG9_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
