zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA1_TRIG0_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG10_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG11_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG12_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG13_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG14_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG15_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG16_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG17_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG18_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG19_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG1_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG20_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG21_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG22_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG23_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG24_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG25_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG26_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG27_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG28_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG29_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG2_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG30_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG31_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG32_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG3_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG4_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG5_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG6_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG7_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG8_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define DMA1_TRIG9_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define FC4_SSEL3_PIO1_2 IOPCTL_MUX(0, 34, 1) /* PIO1_2 */
#define GPIO_PIO12_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT0_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT1_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT2_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT3_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT4_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT5_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT6_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT_PINT7_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define SCT0_IN0_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN1_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN2_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN3_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN4_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN5_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN6_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_OUT9_PIO1_2 IOPCTL_MUX(0, 34, 3) /* PIO1_2 */
#define DMA0_TRIG0_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG10_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG11_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG12_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG13_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG14_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG15_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG16_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG17_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG18_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG19_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG1_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG20_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG21_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG22_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG23_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG24_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG25_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG26_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG27_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG28_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG29_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG2_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG30_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG31_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG32_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG3_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG4_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG5_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG6_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG7_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG8_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG9_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG0_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG10_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG11_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG12_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG13_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG14_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG15_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG16_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG17_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG18_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG19_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG1_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG20_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG21_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG22_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG23_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG24_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG25_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG26_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG27_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG28_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG29_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG2_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG30_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG31_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG32_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG3_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG4_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG5_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG6_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG7_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG8_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA1_TRIG9_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define FC5_SCK_PIO1_3 IOPCTL_MUX(0, 35, 1) /* PIO1_3 */
#define GPIO_PIO13_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT0_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT1_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT2_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT3_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT4_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT5_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT6_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT_PINT7_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define DMA0_TRIG0_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG10_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG11_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG12_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG13_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG14_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG15_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG16_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG17_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG18_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG19_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG1_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG20_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG21_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG22_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG23_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG24_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG25_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG26_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG27_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG28_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG29_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG2_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG30_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG31_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG32_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG3_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG4_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG5_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG6_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG7_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG8_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG9_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG0_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG10_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG11_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG12_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG13_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG14_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG15_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG16_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG17_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG18_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG19_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG1_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG20_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG21_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG22_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG23_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG24_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG25_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG26_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG27_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG28_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG29_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG2_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG30_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG31_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG32_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG3_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG4_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG5_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG6_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG7_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG8_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA1_TRIG9_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define FC5_TXD_SCL_MISO_WS_PIO1_4 IOPCTL_MUX(0, 36, 1) /* PIO1_4 */
#define GPIO_PIO14_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT0_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT1_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT2_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT3_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT4_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT5_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT6_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT_PINT7_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define DMA0_TRIG0_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG10_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG11_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG12_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG13_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG14_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG15_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG16_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG17_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG18_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG19_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG1_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG20_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG21_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG22_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG23_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG24_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG25_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG26_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG27_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG28_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG29_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG2_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG30_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG31_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG32_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG3_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG4_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG5_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG6_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG7_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG8_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG9_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG0_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG10_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG11_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG12_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG13_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG14_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG15_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG16_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG17_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG18_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG19_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG1_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG20_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG21_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG22_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG23_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG24_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG25_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG26_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG27_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG28_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG29_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG2_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG30_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG31_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG32_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG3_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG4_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG5_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG6_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG7_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG8_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA1_TRIG9_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define FC5_RXD_SDA_MOSI_DATA_PIO1_5 IOPCTL_MUX(0, 37, 1) /* PIO1_5 */
#define GPIO_PIO15_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT0_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT1_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT2_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT3_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT4_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT5_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT6_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT_PINT7_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define DMA0_TRIG0_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG10_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG11_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG12_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG13_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG14_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG15_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG16_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG17_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG18_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG19_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG1_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG20_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG21_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG22_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG23_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG24_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG25_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG26_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG27_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG28_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG29_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG2_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG30_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG31_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG32_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG3_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG4_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG5_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG6_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG7_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG8_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA0_TRIG9_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG0_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG10_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG11_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG12_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG13_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG14_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG15_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG16_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG17_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG18_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG19_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG1_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG20_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG21_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG22_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG23_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG24_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG25_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG26_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG27_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG28_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG29_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG2_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG30_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG31_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG32_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG3_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG4_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG5_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG6_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG7_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG8_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define DMA1_TRIG9_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define FC4_SSEL2_PIO1_6 IOPCTL_MUX(0, 38, 5) /* PIO1_6 */
#define FC5_CTS_SDA_SSEL0_PIO1_6 IOPCTL_MUX(0, 38, 1) /* PIO1_6 */
#define GPIO_PIO16_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT0_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT1_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT2_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT3_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT4_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT5_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT6_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT_PINT7_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define SCT0_IN0_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN1_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN2_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN3_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN4_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN5_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN6_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_OUT4_PIO1_6 IOPCTL_MUX(0, 38, 3) /* PIO1_6 */
#define CTIMER0_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define DMA0_TRIG0_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG10_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG11_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG12_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG13_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG14_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG15_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG16_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG17_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG18_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
