zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG19_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG1_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG20_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG21_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG22_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG23_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG24_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG25_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG26_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG27_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG28_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG29_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG2_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG30_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG31_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG32_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG3_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG4_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG5_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG6_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG7_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG8_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA0_TRIG9_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG0_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG10_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG11_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG12_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG13_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG14_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG15_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG16_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG17_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG18_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG19_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG1_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG20_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG21_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG22_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG23_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG24_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG25_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG26_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG27_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG28_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG29_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG2_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG30_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG31_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG32_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG3_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG4_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG5_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG6_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG7_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG8_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define DMA1_TRIG9_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define FC4_SSEL3_PIO1_7 IOPCTL_MUX(0, 39, 5) /* PIO1_7 */
#define FC5_RTS_SCL_SSEL1_PIO1_7 IOPCTL_MUX(0, 39, 1) /* PIO1_7 */
#define GPIO_PIO17_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT0_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT1_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT2_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT3_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT4_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT5_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT6_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT_PINT7_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define SCT0_IN0_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN1_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN2_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN3_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN4_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN5_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN6_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_OUT5_PIO1_7 IOPCTL_MUX(0, 39, 3) /* PIO1_7 */
#define ADC0_CH4_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define CTIMER0_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER0_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER0_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER0_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER1_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER1_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER1_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER1_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER1_MATCH2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER2_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER2_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER2_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER3_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER3_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER3_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER3_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER4_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER4_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER4_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CTIMER4_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define DMA0_TRIG0_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG10_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG11_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG12_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG13_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG14_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG15_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG16_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG17_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG18_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG19_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG1_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG20_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG21_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG22_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG23_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG24_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG25_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG26_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG27_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG28_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG29_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG2_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG30_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG31_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG32_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG3_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG4_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG5_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG6_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG7_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG8_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA0_TRIG9_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG0_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG10_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG11_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG12_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG13_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG14_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG15_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG16_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG17_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG18_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG19_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG1_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG20_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG21_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG22_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG23_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG24_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG25_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG26_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG27_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG28_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG29_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG2_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG30_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG31_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG32_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG3_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG4_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG5_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG6_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG7_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG8_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define DMA1_TRIG9_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define FC5_SSEL2_PIO1_8 IOPCTL_MUX(0, 40, 1) /* PIO1_8 */
#define GPIO_PIO18_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT0_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT1_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT2_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT3_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT4_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT5_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT6_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT_PINT7_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define SCT0_IN0_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN1_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN2_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN3_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN4_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN5_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN6_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define ADC0_CH12_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define CTIMER1_MATCH3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define DMA0_TRIG0_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG10_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG11_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG12_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG13_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG14_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG15_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG16_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG17_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG18_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG19_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG1_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG20_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG21_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG22_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG23_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG24_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG25_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG26_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG27_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG28_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG29_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG2_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG30_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG31_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG32_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG3_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG4_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG5_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG6_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG7_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG8_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA0_TRIG9_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG0_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG10_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG11_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG12_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG13_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG14_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG15_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG16_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG17_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG18_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG19_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG1_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG20_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG21_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG22_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG23_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG24_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG25_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG26_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG27_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG28_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG29_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG2_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG30_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG31_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG32_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG3_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG4_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG5_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG6_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG7_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG8_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define DMA1_TRIG9_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define FC5_SSEL3_PIO1_9 IOPCTL_MUX(0, 41, 1) /* PIO1_9 */
#define GPIO_PIO19_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT0_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT1_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT2_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT3_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT4_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT5_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT6_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT_PINT7_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define SCT0_IN0_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN1_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN2_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN3_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN4_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN5_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN6_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define UTICK0_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 3) /* PIO1_9 */
#define CLKOUT_PIO1_10 IOPCTL_MUX(0, 42, 7) /* PIO1_10 */
#define CTIMER0_CAPTURE0_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER0_CAPTURE1_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER0_CAPTURE2_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER0_CAPTURE3_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER1_CAPTURE0_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER1_CAPTURE1_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER1_CAPTURE2_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER1_CAPTURE3_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER2_CAPTURE0_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER2_CAPTURE1_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER2_CAPTURE2_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER2_CAPTURE3_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER3_CAPTURE0_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER3_CAPTURE1_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER3_CAPTURE2_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER3_CAPTURE3_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER4_CAPTURE0_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER4_CAPTURE1_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER4_CAPTURE2_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define CTIMER4_CAPTURE3_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define DMA0_TRIG0_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG10_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG11_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG12_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG13_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG14_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG15_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG16_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG17_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG18_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG19_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG1_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG20_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG21_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG22_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG23_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG24_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG25_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG26_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG27_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG28_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG29_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG2_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG30_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG31_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG32_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG3_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG4_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG5_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG6_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG7_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG8_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA0_TRIG9_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG0_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG10_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG11_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG12_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG13_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG14_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG15_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG16_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG17_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG18_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG19_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG1_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG20_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG21_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG22_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG23_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG24_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG25_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG26_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG27_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG28_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG29_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG2_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG30_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG31_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG32_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG3_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG4_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG5_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG6_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG7_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG8_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define DMA1_TRIG9_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define FREQME_IN0_PIO1_10 IOPCTL_MUX(0, 42, 3) /* PIO1_10 */
#define FREQME_IN1_PIO1_10 IOPCTL_MUX(0, 42, 3) /* PIO1_10 */
#define GPIO_PIO110_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define MCLK_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define PINT_PINT0_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT_PINT1_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT_PINT2_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT_PINT3_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT_PINT4_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT_PINT5_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT_PINT6_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT_PINT7_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define SCT0_IN0_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define SCT0_IN1_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define SCT0_IN2_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define SCT0_IN3_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define SCT0_IN4_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define SCT0_IN5_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define SCT0_IN6_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define CTIMER2_MATCH0_PIO1_11 IOPCTL_MUX(0, 43, 4) /* PIO1_11 */
#define DMA0_TRIG0_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG10_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG11_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG12_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG13_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG14_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG15_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG16_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG17_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG18_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG19_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG1_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG20_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG21_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG22_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG23_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
