zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG24_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG25_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG26_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG27_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG28_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG29_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG2_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG30_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG31_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG32_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG3_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG4_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG5_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG6_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG7_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG8_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA0_TRIG9_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG0_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG10_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG11_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG12_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG13_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG14_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG15_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG16_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG17_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG18_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG19_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG1_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG20_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG21_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG22_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG23_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG24_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG25_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG26_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG27_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG28_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG29_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG2_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG30_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG31_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG32_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG3_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG4_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG5_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG6_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG7_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG8_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define DMA1_TRIG9_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define FLEXSPI0B_DATA0_PIO1_11 IOPCTL_MUX(0, 43, 6) /* PIO1_11 */
#define GPIO_PIO111_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define HS_SPI_SCK_PIO1_11 IOPCTL_MUX(0, 43, 1) /* PIO1_11 */
#define PINT_PINT0_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT_PINT1_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT_PINT2_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT_PINT3_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT_PINT4_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT_PINT5_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT_PINT6_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT_PINT7_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define CTIMER2_MATCH1_PIO1_12 IOPCTL_MUX(0, 44, 4) /* PIO1_12 */
#define DMA0_TRIG0_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG10_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG11_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG12_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG13_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG14_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG15_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG16_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG17_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG18_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG19_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG1_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG20_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG21_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG22_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG23_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG24_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG25_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG26_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG27_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG28_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG29_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG2_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG30_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG31_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG32_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG3_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG4_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG5_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG6_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG7_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG8_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA0_TRIG9_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG0_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG10_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG11_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG12_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG13_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG14_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG15_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG16_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG17_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG18_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG19_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG1_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG20_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG21_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG22_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG23_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG24_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG25_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG26_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG27_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG28_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG29_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG2_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG30_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG31_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG32_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG3_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG4_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG5_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG6_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG7_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG8_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define DMA1_TRIG9_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define FLEXSPI0B_DATA1_PIO1_12 IOPCTL_MUX(0, 44, 6) /* PIO1_12 */
#define GPIO_PIO112_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define HS_SPI_MISO_PIO1_12 IOPCTL_MUX(0, 44, 1) /* PIO1_12 */
#define PINT_PINT0_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT_PINT1_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT_PINT2_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT_PINT3_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT_PINT4_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT_PINT5_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT_PINT6_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT_PINT7_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define CTIMER2_MATCH2_PIO1_13 IOPCTL_MUX(0, 45, 4) /* PIO1_13 */
#define DMA0_TRIG0_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG10_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG11_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG12_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG13_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG14_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG15_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG16_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG17_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG18_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG19_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG1_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG20_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG21_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG22_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG23_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG24_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG25_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG26_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG27_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG28_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG29_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG2_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG30_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG31_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG32_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG3_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG4_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG5_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG6_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG7_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG8_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA0_TRIG9_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG0_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG10_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG11_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG12_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG13_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG14_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG15_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG16_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG17_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG18_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG19_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG1_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG20_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG21_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG22_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG23_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG24_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG25_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG26_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG27_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG28_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG29_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG2_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG30_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG31_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG32_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG3_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG4_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG5_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG6_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG7_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG8_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define DMA1_TRIG9_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define FLEXSPI0B_DATA2_PIO1_13 IOPCTL_MUX(0, 45, 6) /* PIO1_13 */
#define GPIO_PIO113_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define HS_SPI_MOSI_PIO1_13 IOPCTL_MUX(0, 45, 1) /* PIO1_13 */
#define PINT_PINT0_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT_PINT1_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT_PINT2_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT_PINT3_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT_PINT4_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT_PINT5_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT_PINT6_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT_PINT7_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define CTIMER2_MATCH3_PIO1_14 IOPCTL_MUX(0, 46, 4) /* PIO1_14 */
#define DMA0_TRIG0_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG10_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG11_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG12_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG13_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG14_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG15_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG16_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG17_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG18_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG19_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG1_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG20_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG21_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG22_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG23_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG24_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG25_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG26_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG27_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG28_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG29_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG2_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG30_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG31_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG32_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG3_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG4_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG5_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG6_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG7_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG8_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA0_TRIG9_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG0_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG10_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG11_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG12_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG13_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG14_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG15_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG16_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG17_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG18_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG19_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG1_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG20_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG21_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG22_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG23_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG24_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG25_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG26_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG27_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG28_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG29_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG2_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG30_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG31_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG32_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG3_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG4_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG5_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG6_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG7_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG8_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define DMA1_TRIG9_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define FLEXSPI0B_DATA3_PIO1_14 IOPCTL_MUX(0, 46, 6) /* PIO1_14 */
#define GPIO_PIO114_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define HS_SPI_SSEL0_PIO1_14 IOPCTL_MUX(0, 46, 1) /* PIO1_14 */
#define PINT_PINT0_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT_PINT1_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT_PINT2_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT_PINT3_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT_PINT4_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT_PINT5_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT_PINT6_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT_PINT7_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define CTIMER3_MATCH0_PIO1_15 IOPCTL_MUX(0, 47, 4) /* PIO1_15 */
#define DMA0_TRIG0_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG10_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG11_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG12_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG13_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG14_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG15_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG16_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG17_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG18_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG19_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG1_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG20_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG21_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG22_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG23_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG24_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG25_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG26_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG27_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG28_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG29_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG2_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG30_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG31_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG32_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG3_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG4_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG5_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG6_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG7_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG8_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA0_TRIG9_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG0_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG10_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG11_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG12_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG13_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG14_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG15_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG16_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG17_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG18_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG19_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG1_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG20_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG21_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG22_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG23_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG24_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG25_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG26_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG27_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG28_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG29_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG2_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG30_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG31_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG32_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG3_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG4_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG5_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG6_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG7_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG8_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define DMA1_TRIG9_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define GPIO_PIO115_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define HS_SPI_SSEL1_PIO1_15 IOPCTL_MUX(0, 47, 1) /* PIO1_15 */
#define PINT_PINT0_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT_PINT1_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT_PINT2_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT_PINT3_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT_PINT4_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT_PINT5_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT_PINT6_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT_PINT7_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define CTIMER3_MATCH1_PIO1_16 IOPCTL_MUX(0, 48, 4) /* PIO1_16 */
#define DMA0_TRIG0_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG10_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG11_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG12_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG13_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG14_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG15_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG16_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG17_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
