zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG18_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG19_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG1_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG20_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG21_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG22_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG23_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG24_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG25_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG26_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG27_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG28_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG29_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG2_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG30_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG31_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG32_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG3_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG4_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG5_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG6_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG7_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG8_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA0_TRIG9_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG0_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG10_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG11_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG12_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG13_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG14_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG15_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG16_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG17_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG18_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG19_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG1_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG20_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG21_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG22_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG23_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG24_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG25_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG26_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG27_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG28_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG29_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG2_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG30_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG31_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG32_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG3_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG4_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG5_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG6_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG7_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG8_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define DMA1_TRIG9_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define GPIO_PIO116_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define HS_SPI_SSEL2_PIO1_16 IOPCTL_MUX(0, 48, 1) /* PIO1_16 */
#define PINT_PINT0_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT_PINT1_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT_PINT2_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT_PINT3_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT_PINT4_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT_PINT5_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT_PINT6_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT_PINT7_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define SCT0_OUT8_PIO1_16 IOPCTL_MUX(0, 48, 2) /* PIO1_16 */
#define CTIMER3_MATCH2_PIO1_17 IOPCTL_MUX(0, 49, 4) /* PIO1_17 */
#define DMA0_TRIG0_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG10_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG11_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG12_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG13_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG14_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG15_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG16_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG17_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG18_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG19_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG1_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG20_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG21_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG22_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG23_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG24_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG25_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG26_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG27_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG28_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG29_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG2_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG30_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG31_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG32_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG3_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG4_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG5_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG6_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG7_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG8_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA0_TRIG9_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG0_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG10_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG11_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG12_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG13_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG14_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG15_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG16_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG17_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG18_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG19_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG1_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG20_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG21_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG22_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG23_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG24_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG25_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG26_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG27_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG28_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG29_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG2_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG30_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG31_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG32_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG3_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG4_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG5_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG6_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG7_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG8_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define DMA1_TRIG9_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define GPIO_PIO117_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define HS_SPI_SSEL3_PIO1_17 IOPCTL_MUX(0, 49, 1) /* PIO1_17 */
#define PINT_PINT0_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT_PINT1_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT_PINT2_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT_PINT3_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT_PINT4_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT_PINT5_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT_PINT6_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT_PINT7_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define SCT0_OUT9_PIO1_17 IOPCTL_MUX(0, 49, 2) /* PIO1_17 */
#define CTIMER3_MATCH3_PIO1_18 IOPCTL_MUX(0, 50, 4) /* PIO1_18 */
#define DMA0_TRIG0_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG10_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG11_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG12_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG13_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG14_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG15_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG16_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG17_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG18_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG19_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG1_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG20_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG21_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG22_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG23_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG24_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG25_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG26_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG27_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG28_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG29_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG2_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG30_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG31_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG32_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG3_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG4_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG5_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG6_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG7_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG8_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA0_TRIG9_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG0_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG10_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG11_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG12_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG13_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG14_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG15_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG16_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG17_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG18_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG19_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG1_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG20_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG21_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG22_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG23_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG24_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG25_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG26_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG27_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG28_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG29_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG2_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG30_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG31_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG32_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG3_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG4_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG5_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG6_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG7_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG8_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define DMA1_TRIG9_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define FLEXSPI0A_SCLK_PIO1_18 IOPCTL_MUX(0, 50, 1) /* PIO1_18 */
#define GPIO_PIO118_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT0_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT1_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT2_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT3_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT4_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT5_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT6_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT_PINT7_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define SCT0_IN0_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define SCT0_IN1_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define SCT0_IN2_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define SCT0_IN3_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define SCT0_IN4_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define SCT0_IN5_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define SCT0_IN6_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define CTIMER4_MATCH0_PIO1_19 IOPCTL_MUX(0, 51, 4) /* PIO1_19 */
#define DMA0_TRIG0_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG10_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG11_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG12_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG13_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG14_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG15_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG16_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG17_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG18_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG19_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG1_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG20_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG21_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG22_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG23_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG24_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG25_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG26_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG27_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG28_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG29_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG2_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG30_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG31_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG32_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG3_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG4_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG5_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG6_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG7_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG8_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA0_TRIG9_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG0_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG10_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG11_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG12_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG13_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG14_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG15_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG16_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG17_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG18_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG19_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG1_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG20_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG21_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG22_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG23_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG24_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG25_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG26_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG27_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG28_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG29_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG2_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG30_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG31_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG32_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG3_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG4_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG5_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG6_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG7_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG8_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define DMA1_TRIG9_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define FLEXSPI0A_SS0_N_PIO1_19 IOPCTL_MUX(0, 51, 1) /* PIO1_19 */
#define GPIO_PIO119_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT0_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT1_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT2_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT3_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT4_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT5_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT6_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT_PINT7_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define SCT0_OUT0_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define CTIMER4_MATCH1_PIO1_20 IOPCTL_MUX(0, 52, 4) /* PIO1_20 */
#define DMA0_TRIG0_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG10_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG11_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG12_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG13_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG14_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG15_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG16_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG17_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG18_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG19_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG1_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG20_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG21_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG22_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG23_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG24_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG25_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG26_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG27_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG28_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG29_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG2_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG30_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG31_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG32_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG3_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG4_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG5_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG6_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG7_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG8_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA0_TRIG9_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG0_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG10_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG11_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG12_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG13_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG14_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG15_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG16_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG17_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG18_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG19_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG1_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG20_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG21_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG22_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG23_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG24_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG25_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG26_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG27_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG28_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG29_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG2_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG30_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG31_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG32_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG3_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG4_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG5_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG6_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG7_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG8_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define DMA1_TRIG9_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define FLEXSPI0A_DATA0_PIO1_20 IOPCTL_MUX(0, 52, 1) /* PIO1_20 */
#define GPIO_PIO120_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define PINT_PINT0_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define PINT_PINT1_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define PINT_PINT2_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define PINT_PINT3_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define PINT_PINT4_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define PINT_PINT5_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
