zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define PINT_PINT6_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define PINT_PINT7_PIO1_20 IOPCTL_MUX(0, 52, 0) /* PIO1_20 */
#define SCT0_IN0_PIO1_20 IOPCTL_MUX(0, 52, 2) /* PIO1_20 */
#define SCT0_IN1_PIO1_20 IOPCTL_MUX(0, 52, 2) /* PIO1_20 */
#define SCT0_IN2_PIO1_20 IOPCTL_MUX(0, 52, 2) /* PIO1_20 */
#define SCT0_IN3_PIO1_20 IOPCTL_MUX(0, 52, 2) /* PIO1_20 */
#define SCT0_IN4_PIO1_20 IOPCTL_MUX(0, 52, 2) /* PIO1_20 */
#define SCT0_IN5_PIO1_20 IOPCTL_MUX(0, 52, 2) /* PIO1_20 */
#define SCT0_IN6_PIO1_20 IOPCTL_MUX(0, 52, 2) /* PIO1_20 */
#define CTIMER4_MATCH2_PIO1_21 IOPCTL_MUX(0, 53, 4) /* PIO1_21 */
#define DMA0_TRIG0_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG10_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG11_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG12_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG13_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG14_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG15_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG16_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG17_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG18_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG19_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG1_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG20_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG21_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG22_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG23_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG24_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG25_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG26_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG27_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG28_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG29_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG2_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG30_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG31_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG32_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG3_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG4_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG5_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG6_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG7_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG8_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA0_TRIG9_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG0_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG10_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG11_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG12_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG13_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG14_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG15_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG16_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG17_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG18_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG19_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG1_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG20_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG21_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG22_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG23_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG24_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG25_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG26_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG27_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG28_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG29_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG2_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG30_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG31_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG32_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG3_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG4_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG5_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG6_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG7_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG8_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define DMA1_TRIG9_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define FLEXSPI0A_DATA1_PIO1_21 IOPCTL_MUX(0, 53, 1) /* PIO1_21 */
#define GPIO_PIO121_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT0_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT1_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT2_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT3_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT4_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT5_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT6_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define PINT_PINT7_PIO1_21 IOPCTL_MUX(0, 53, 0) /* PIO1_21 */
#define SCT0_OUT1_PIO1_21 IOPCTL_MUX(0, 53, 2) /* PIO1_21 */
#define CTIMER4_MATCH3_PIO1_22 IOPCTL_MUX(0, 54, 4) /* PIO1_22 */
#define DMA0_TRIG0_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG10_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG11_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG12_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG13_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG14_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG15_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG16_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG17_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG18_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG19_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG1_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG20_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG21_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG22_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG23_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG24_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG25_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG26_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG27_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG28_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG29_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG2_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG30_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG31_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG32_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG3_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG4_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG5_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG6_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG7_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG8_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA0_TRIG9_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG0_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG10_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG11_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG12_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG13_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG14_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG15_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG16_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG17_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG18_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG19_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG1_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG20_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG21_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG22_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG23_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG24_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG25_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG26_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG27_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG28_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG29_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG2_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG30_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG31_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG32_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG3_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG4_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG5_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG6_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG7_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG8_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define DMA1_TRIG9_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define FLEXSPI0A_DATA2_PIO1_22 IOPCTL_MUX(0, 54, 1) /* PIO1_22 */
#define GPIO_PIO122_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT0_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT1_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT2_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT3_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT4_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT5_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT6_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define PINT_PINT7_PIO1_22 IOPCTL_MUX(0, 54, 0) /* PIO1_22 */
#define SCT0_IN0_PIO1_22 IOPCTL_MUX(0, 54, 2) /* PIO1_22 */
#define SCT0_IN1_PIO1_22 IOPCTL_MUX(0, 54, 2) /* PIO1_22 */
#define SCT0_IN2_PIO1_22 IOPCTL_MUX(0, 54, 2) /* PIO1_22 */
#define SCT0_IN3_PIO1_22 IOPCTL_MUX(0, 54, 2) /* PIO1_22 */
#define SCT0_IN4_PIO1_22 IOPCTL_MUX(0, 54, 2) /* PIO1_22 */
#define SCT0_IN5_PIO1_22 IOPCTL_MUX(0, 54, 2) /* PIO1_22 */
#define SCT0_IN6_PIO1_22 IOPCTL_MUX(0, 54, 2) /* PIO1_22 */
#define CTIMER0_CAPTURE0_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER0_CAPTURE1_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER0_CAPTURE2_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER0_CAPTURE3_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER1_CAPTURE0_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER1_CAPTURE1_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER1_CAPTURE2_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER1_CAPTURE3_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER2_CAPTURE0_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER2_CAPTURE1_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER2_CAPTURE2_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER2_CAPTURE3_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER3_CAPTURE0_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER3_CAPTURE1_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER3_CAPTURE2_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER3_CAPTURE3_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER4_CAPTURE0_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER4_CAPTURE1_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER4_CAPTURE2_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define CTIMER4_CAPTURE3_PIO1_23 IOPCTL_MUX(0, 55, 4) /* PIO1_23 */
#define DMA0_TRIG0_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG10_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG11_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG12_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG13_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG14_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG15_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG16_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG17_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG18_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG19_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG1_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG20_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG21_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG22_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG23_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG24_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG25_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG26_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG27_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG28_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG29_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG2_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG30_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG31_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG32_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG3_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG4_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG5_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG6_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG7_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG8_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA0_TRIG9_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG0_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG10_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG11_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG12_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG13_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG14_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG15_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG16_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG17_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG18_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG19_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG1_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG20_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG21_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG22_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG23_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG24_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG25_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG26_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG27_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG28_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG29_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG2_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG30_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG31_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG32_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG3_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG4_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG5_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG6_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG7_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG8_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define DMA1_TRIG9_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define FLEXSPI0A_DATA3_PIO1_23 IOPCTL_MUX(0, 55, 1) /* PIO1_23 */
#define GPIO_PIO123_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT0_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT1_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT2_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT3_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT4_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT5_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT6_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define PINT_PINT7_PIO1_23 IOPCTL_MUX(0, 55, 0) /* PIO1_23 */
#define SCT0_OUT2_PIO1_23 IOPCTL_MUX(0, 55, 2) /* PIO1_23 */
#define DMA0_TRIG0_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG10_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG11_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG12_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG13_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG14_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG15_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG16_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG17_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG18_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG19_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG1_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG20_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG21_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG22_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG23_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG24_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG25_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG26_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG27_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG28_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG29_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG2_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG30_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG31_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG32_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG3_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG4_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG5_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG6_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG7_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG8_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA0_TRIG9_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG0_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG10_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG11_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG12_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG13_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG14_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG15_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG16_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG17_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG18_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG19_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG1_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG20_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG21_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG22_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG23_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG24_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG25_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG26_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG27_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG28_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG29_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG2_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG30_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG31_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG32_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG3_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG4_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG5_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG6_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG7_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG8_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define DMA1_TRIG9_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define FLEXSPI0A_DATA4_PIO1_24 IOPCTL_MUX(0, 56, 1) /* PIO1_24 */
#define GPIO_PIO124_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT0_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT1_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT2_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT3_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT4_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT5_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT6_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define PINT_PINT7_PIO1_24 IOPCTL_MUX(0, 56, 0) /* PIO1_24 */
#define SCT0_IN0_PIO1_24 IOPCTL_MUX(0, 56, 2) /* PIO1_24 */
#define SCT0_IN1_PIO1_24 IOPCTL_MUX(0, 56, 2) /* PIO1_24 */
#define SCT0_IN2_PIO1_24 IOPCTL_MUX(0, 56, 2) /* PIO1_24 */
#define SCT0_IN3_PIO1_24 IOPCTL_MUX(0, 56, 2) /* PIO1_24 */
#define SCT0_IN4_PIO1_24 IOPCTL_MUX(0, 56, 2) /* PIO1_24 */
#define SCT0_IN5_PIO1_24 IOPCTL_MUX(0, 56, 2) /* PIO1_24 */
#define SCT0_IN6_PIO1_24 IOPCTL_MUX(0, 56, 2) /* PIO1_24 */
#define DMA0_TRIG0_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG10_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG11_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG12_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG13_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG14_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG15_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG16_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG17_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG18_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG19_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG1_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG20_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG21_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG22_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG23_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG24_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG25_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG26_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG27_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG28_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG29_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG2_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG30_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG31_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG32_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG3_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG4_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG5_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG6_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG7_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
