zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define DMA0_TRIG8_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA0_TRIG9_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG0_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG10_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG11_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG12_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG13_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG14_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG15_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG16_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG17_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG18_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG19_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG1_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG20_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG21_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG22_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG23_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG24_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG25_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG26_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG27_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG28_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG29_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG2_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG30_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG31_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG32_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG3_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG4_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG5_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG6_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG7_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG8_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define DMA1_TRIG9_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define FLEXSPI0A_DATA5_PIO1_25 IOPCTL_MUX(0, 57, 1) /* PIO1_25 */
#define GPIO_PIO125_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT0_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT1_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT2_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT3_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT4_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT5_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT6_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define PINT_PINT7_PIO1_25 IOPCTL_MUX(0, 57, 0) /* PIO1_25 */
#define SCT0_OUT3_PIO1_25 IOPCTL_MUX(0, 57, 2) /* PIO1_25 */
#define DMA0_TRIG0_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG10_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG11_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG12_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG13_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG14_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG15_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG16_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG17_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG18_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG19_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG1_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG20_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG21_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG22_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG23_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG24_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG25_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG26_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG27_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG28_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG29_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG2_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG30_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG31_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG32_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG3_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG4_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG5_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG6_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG7_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG8_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA0_TRIG9_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG0_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG10_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG11_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG12_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG13_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG14_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG15_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG16_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG17_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG18_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG19_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG1_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG20_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG21_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG22_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG23_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG24_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG25_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG26_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG27_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG28_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG29_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG2_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG30_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG31_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG32_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG3_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG4_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG5_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG6_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG7_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG8_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define DMA1_TRIG9_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define FLEXSPI0A_DATA6_PIO1_26 IOPCTL_MUX(0, 58, 1) /* PIO1_26 */
#define GPIO_PIO126_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT0_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT1_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT2_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT3_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT4_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT5_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT6_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define PINT_PINT7_PIO1_26 IOPCTL_MUX(0, 58, 0) /* PIO1_26 */
#define SCT0_IN0_PIO1_26 IOPCTL_MUX(0, 58, 2) /* PIO1_26 */
#define SCT0_IN1_PIO1_26 IOPCTL_MUX(0, 58, 2) /* PIO1_26 */
#define SCT0_IN2_PIO1_26 IOPCTL_MUX(0, 58, 2) /* PIO1_26 */
#define SCT0_IN3_PIO1_26 IOPCTL_MUX(0, 58, 2) /* PIO1_26 */
#define SCT0_IN4_PIO1_26 IOPCTL_MUX(0, 58, 2) /* PIO1_26 */
#define SCT0_IN5_PIO1_26 IOPCTL_MUX(0, 58, 2) /* PIO1_26 */
#define SCT0_IN6_PIO1_26 IOPCTL_MUX(0, 58, 2) /* PIO1_26 */
#define DMA0_TRIG0_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG10_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG11_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG12_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG13_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG14_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG15_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG16_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG17_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG18_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG19_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG1_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG20_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG21_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG22_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG23_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG24_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG25_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG26_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG27_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG28_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG29_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG2_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG30_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG31_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG32_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG3_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG4_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG5_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG6_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG7_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG8_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA0_TRIG9_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG0_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG10_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG11_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG12_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG13_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG14_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG15_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG16_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG17_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG18_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG19_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG1_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG20_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG21_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG22_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG23_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG24_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG25_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG26_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG27_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG28_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG29_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG2_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG30_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG31_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG32_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG3_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG4_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG5_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG6_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG7_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG8_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define DMA1_TRIG9_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define FLEXSPI0A_DATA7_PIO1_27 IOPCTL_MUX(0, 59, 1) /* PIO1_27 */
#define GPIO_PIO127_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT0_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT1_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT2_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT3_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT4_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT5_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT6_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define PINT_PINT7_PIO1_27 IOPCTL_MUX(0, 59, 0) /* PIO1_27 */
#define SCT0_OUT4_PIO1_27 IOPCTL_MUX(0, 59, 2) /* PIO1_27 */
#define DMA0_TRIG0_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG10_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG11_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG12_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG13_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG14_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG15_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG16_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG17_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG18_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG19_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG1_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG20_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG21_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG22_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG23_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG24_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG25_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG26_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG27_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG28_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG29_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG2_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG30_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG31_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG32_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG3_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG4_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG5_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG6_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG7_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG8_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA0_TRIG9_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG0_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG10_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG11_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG12_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG13_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG14_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG15_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG16_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG17_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG18_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG19_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG1_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG20_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG21_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG22_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG23_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG24_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG25_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG26_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG27_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG28_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG29_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG2_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG30_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG31_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG32_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG3_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG4_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG5_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG6_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG7_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG8_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define DMA1_TRIG9_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define FLEXSPI0A_DQS_PIO1_28 IOPCTL_MUX(0, 60, 1) /* PIO1_28 */
#define GPIO_PIO128_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT0_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT1_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT2_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT3_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT4_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT5_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT6_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define PINT_PINT7_PIO1_28 IOPCTL_MUX(0, 60, 0) /* PIO1_28 */
#define SCT0_IN0_PIO1_28 IOPCTL_MUX(0, 60, 2) /* PIO1_28 */
#define SCT0_IN1_PIO1_28 IOPCTL_MUX(0, 60, 2) /* PIO1_28 */
#define SCT0_IN2_PIO1_28 IOPCTL_MUX(0, 60, 2) /* PIO1_28 */
#define SCT0_IN3_PIO1_28 IOPCTL_MUX(0, 60, 2) /* PIO1_28 */
#define SCT0_IN4_PIO1_28 IOPCTL_MUX(0, 60, 2) /* PIO1_28 */
#define SCT0_IN5_PIO1_28 IOPCTL_MUX(0, 60, 2) /* PIO1_28 */
#define SCT0_IN6_PIO1_28 IOPCTL_MUX(0, 60, 2) /* PIO1_28 */
#define CTIMER0_CAPTURE0_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER0_CAPTURE1_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER0_CAPTURE2_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER0_CAPTURE3_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER1_CAPTURE0_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER1_CAPTURE1_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER1_CAPTURE2_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER1_CAPTURE3_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER2_CAPTURE0_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER2_CAPTURE1_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER2_CAPTURE2_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER2_CAPTURE3_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER3_CAPTURE0_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER3_CAPTURE1_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER3_CAPTURE2_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER3_CAPTURE3_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER4_CAPTURE0_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER4_CAPTURE1_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER4_CAPTURE2_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define CTIMER4_CAPTURE3_PIO1_29 IOPCTL_MUX(0, 61, 4) /* PIO1_29 */
#define DMA0_TRIG0_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG10_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG11_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG12_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG13_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG14_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG15_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG16_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG17_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG18_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG19_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG1_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG20_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG21_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG22_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG23_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG24_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG25_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG26_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG27_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG28_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG29_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG2_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG30_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG31_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG32_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG3_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG4_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG5_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG6_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG7_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG8_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA0_TRIG9_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG0_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG10_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG11_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG12_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG13_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG14_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG15_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG16_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG17_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG18_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG19_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG1_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG20_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG21_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG22_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG23_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG24_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG25_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG26_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG27_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG28_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG29_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG2_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG30_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG31_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG32_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG3_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG4_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG5_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG6_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG7_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG8_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define DMA1_TRIG9_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define FLEXSPI0A_SS1_N_PIO1_29 IOPCTL_MUX(0, 61, 1) /* PIO1_29 */
#define FLEXSPI0B_SCLK_PIO1_29 IOPCTL_MUX(0, 61, 5) /* PIO1_29 */
#define GPIO_PIO129_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define PINT_PINT0_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define PINT_PINT1_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define PINT_PINT2_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
