zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define PINT_PINT3_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define PINT_PINT4_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define PINT_PINT5_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define PINT_PINT6_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define PINT_PINT7_PIO1_29 IOPCTL_MUX(0, 61, 0) /* PIO1_29 */
#define SCT0_OUT5_PIO1_29 IOPCTL_MUX(0, 61, 2) /* PIO1_29 */
#define UTICK0_CAPTURE2_PIO1_29 IOPCTL_MUX(0, 61, 3) /* PIO1_29 */
#define DMA0_TRIG0_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG10_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG11_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG12_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG13_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG14_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG15_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG16_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG17_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG18_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG19_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG1_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG20_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG21_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG22_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG23_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG24_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG25_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG26_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG27_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG28_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG29_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG2_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG30_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG31_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG32_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG3_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG4_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG5_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG6_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG7_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG8_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA0_TRIG9_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG0_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG10_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG11_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG12_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG13_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG14_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG15_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG16_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG17_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG18_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG19_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG1_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG20_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG21_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG22_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG23_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG24_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG25_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG26_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG27_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG28_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG29_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG2_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG30_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG31_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG32_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG3_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG4_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG5_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG6_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG7_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG8_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define DMA1_TRIG9_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define GPIO_PIO130_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT0_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT1_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT2_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT3_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT4_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT5_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT6_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define PINT_PINT7_PIO1_30 IOPCTL_MUX(0, 62, 0) /* PIO1_30 */
#define SCT0_IN0_PIO1_30 IOPCTL_MUX(0, 62, 2) /* PIO1_30 */
#define SCT0_IN1_PIO1_30 IOPCTL_MUX(0, 62, 2) /* PIO1_30 */
#define SCT0_IN2_PIO1_30 IOPCTL_MUX(0, 62, 2) /* PIO1_30 */
#define SCT0_IN3_PIO1_30 IOPCTL_MUX(0, 62, 2) /* PIO1_30 */
#define SCT0_IN4_PIO1_30 IOPCTL_MUX(0, 62, 2) /* PIO1_30 */
#define SCT0_IN5_PIO1_30 IOPCTL_MUX(0, 62, 2) /* PIO1_30 */
#define SCT0_IN6_PIO1_30 IOPCTL_MUX(0, 62, 2) /* PIO1_30 */
#define SD0_CLK_PIO1_30 IOPCTL_MUX(0, 62, 1) /* PIO1_30 */
#define DMA0_TRIG0_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG10_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG11_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG12_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG13_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG14_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG15_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG16_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG17_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG18_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG19_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG1_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG20_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG21_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG22_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG23_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG24_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG25_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG26_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG27_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG28_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG29_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG2_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG30_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG31_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG32_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG3_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG4_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG5_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG6_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG7_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG8_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA0_TRIG9_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG0_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG10_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG11_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG12_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG13_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG14_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG15_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG16_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG17_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG18_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG19_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG1_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG20_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG21_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG22_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG23_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG24_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG25_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG26_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG27_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG28_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG29_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG2_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG30_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG31_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG32_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG3_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG4_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG5_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG6_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG7_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG8_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define DMA1_TRIG9_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define GPIO_PIO131_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT0_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT1_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT2_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT3_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT4_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT5_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT6_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define PINT_PINT7_PIO1_31 IOPCTL_MUX(0, 63, 0) /* PIO1_31 */
#define SCT0_IN0_PIO1_31 IOPCTL_MUX(0, 63, 2) /* PIO1_31 */
#define SCT0_IN1_PIO1_31 IOPCTL_MUX(0, 63, 2) /* PIO1_31 */
#define SCT0_IN2_PIO1_31 IOPCTL_MUX(0, 63, 2) /* PIO1_31 */
#define SCT0_IN3_PIO1_31 IOPCTL_MUX(0, 63, 2) /* PIO1_31 */
#define SCT0_IN4_PIO1_31 IOPCTL_MUX(0, 63, 2) /* PIO1_31 */
#define SCT0_IN5_PIO1_31 IOPCTL_MUX(0, 63, 2) /* PIO1_31 */
#define SCT0_IN6_PIO1_31 IOPCTL_MUX(0, 63, 2) /* PIO1_31 */
#define SD0_CMD_PIO1_31 IOPCTL_MUX(0, 63, 1) /* PIO1_31 */
#define GPIO_PIO20_PIO2_0 IOPCTL_MUX(0, 64, 0) /* PIO2_0 */
#define SCT0_IN0_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define SCT0_IN1_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define SCT0_IN2_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define SCT0_IN3_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define SCT0_IN4_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define SCT0_IN5_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define SCT0_IN6_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define USDHC0_USDHC_DATA0_PIO2_0 IOPCTL_MUX(0, 64, 1) /* PIO2_0 */
#define GPIO_PIO21_PIO2_1 IOPCTL_MUX(0, 65, 0) /* PIO2_1 */
#define SCT0_IN0_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define SCT0_IN1_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define SCT0_IN2_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define SCT0_IN3_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define SCT0_IN4_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define SCT0_IN5_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define SCT0_IN6_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define USDHC0_USDHC_DATA1_PIO2_1 IOPCTL_MUX(0, 65, 1) /* PIO2_1 */
#define GPIO_PIO22_PIO2_2 IOPCTL_MUX(0, 66, 0) /* PIO2_2 */
#define SCT0_OUT0_PIO2_2 IOPCTL_MUX(0, 66, 2) /* PIO2_2 */
#define USDHC0_USDHC_DATA2_PIO2_2 IOPCTL_MUX(0, 66, 1) /* PIO2_2 */
#define GPIO_PIO23_PIO2_3 IOPCTL_MUX(0, 67, 0) /* PIO2_3 */
#define SCT0_OUT1_PIO2_3 IOPCTL_MUX(0, 67, 2) /* PIO2_3 */
#define USDHC0_USDHC_DATA3_PIO2_3 IOPCTL_MUX(0, 67, 1) /* PIO2_3 */
#define GPIO_PIO24_PIO2_4 IOPCTL_MUX(0, 68, 0) /* PIO2_4 */
#define SCT0_OUT2_PIO2_4 IOPCTL_MUX(0, 68, 2) /* PIO2_4 */
#define SD0_DS_PIO2_4 IOPCTL_MUX(0, 68, 5) /* PIO2_4 */
#define SD0_WR_PRT_PIO2_4 IOPCTL_MUX(0, 68, 1) /* PIO2_4 */
#define GPIO_PIO25_PIO2_5 IOPCTL_MUX(0, 69, 0) /* PIO2_5 */
#define SCT0_OUT3_PIO2_5 IOPCTL_MUX(0, 69, 2) /* PIO2_5 */
#define USDHC0_USDHC_DATA4_PIO2_5 IOPCTL_MUX(0, 69, 1) /* PIO2_5 */
#define CTIMER1_MATCH0_PIO2_6 IOPCTL_MUX(0, 70, 4) /* PIO2_6 */
#define GPIO_PIO26_PIO2_6 IOPCTL_MUX(0, 70, 0) /* PIO2_6 */
#define SCT0_IN0_PIO2_6 IOPCTL_MUX(0, 70, 2) /* PIO2_6 */
#define SCT0_IN1_PIO2_6 IOPCTL_MUX(0, 70, 2) /* PIO2_6 */
#define SCT0_IN2_PIO2_6 IOPCTL_MUX(0, 70, 2) /* PIO2_6 */
#define SCT0_IN3_PIO2_6 IOPCTL_MUX(0, 70, 2) /* PIO2_6 */
#define SCT0_IN4_PIO2_6 IOPCTL_MUX(0, 70, 2) /* PIO2_6 */
#define SCT0_IN5_PIO2_6 IOPCTL_MUX(0, 70, 2) /* PIO2_6 */
#define SCT0_IN6_PIO2_6 IOPCTL_MUX(0, 70, 2) /* PIO2_6 */
#define USDHC0_USDHC_DATA5_PIO2_6 IOPCTL_MUX(0, 70, 1) /* PIO2_6 */
#define CTIMER1_MATCH1_PIO2_7 IOPCTL_MUX(0, 71, 4) /* PIO2_7 */
#define GPIO_PIO27_PIO2_7 IOPCTL_MUX(0, 71, 0) /* PIO2_7 */
#define SCT0_IN0_PIO2_7 IOPCTL_MUX(0, 71, 2) /* PIO2_7 */
#define SCT0_IN1_PIO2_7 IOPCTL_MUX(0, 71, 2) /* PIO2_7 */
#define SCT0_IN2_PIO2_7 IOPCTL_MUX(0, 71, 2) /* PIO2_7 */
#define SCT0_IN3_PIO2_7 IOPCTL_MUX(0, 71, 2) /* PIO2_7 */
#define SCT0_IN4_PIO2_7 IOPCTL_MUX(0, 71, 2) /* PIO2_7 */
#define SCT0_IN5_PIO2_7 IOPCTL_MUX(0, 71, 2) /* PIO2_7 */
#define SCT0_IN6_PIO2_7 IOPCTL_MUX(0, 71, 2) /* PIO2_7 */
#define USDHC0_USDHC_DATA6_PIO2_7 IOPCTL_MUX(0, 71, 1) /* PIO2_7 */
#define CTIMER1_MATCH2_PIO2_8 IOPCTL_MUX(0, 72, 4) /* PIO2_8 */
#define GPIO_PIO28_PIO2_8 IOPCTL_MUX(0, 72, 0) /* PIO2_8 */
#define SCT0_OUT4_PIO2_8 IOPCTL_MUX(0, 72, 2) /* PIO2_8 */
#define USDHC0_USDHC_DATA7_PIO2_8 IOPCTL_MUX(0, 72, 1) /* PIO2_8 */
#define CTIMER1_MATCH3_PIO2_9 IOPCTL_MUX(0, 73, 4) /* PIO2_9 */
#define GPIO_PIO29_PIO2_9 IOPCTL_MUX(0, 73, 0) /* PIO2_9 */
#define SCT0_OUT5_PIO2_9 IOPCTL_MUX(0, 73, 2) /* PIO2_9 */
#define SD0_CARD_DET_N_PIO2_9 IOPCTL_MUX(0, 73, 1) /* PIO2_9 */
#define CTIMER2_MATCH0_PIO2_10 IOPCTL_MUX(0, 74, 4) /* PIO2_10 */
#define GPIO_PIO210_PIO2_10 IOPCTL_MUX(0, 74, 0) /* PIO2_10 */
#define SCT0_IN0_PIO2_10 IOPCTL_MUX(0, 74, 2) /* PIO2_10 */
#define SCT0_IN1_PIO2_10 IOPCTL_MUX(0, 74, 2) /* PIO2_10 */
#define SCT0_IN2_PIO2_10 IOPCTL_MUX(0, 74, 2) /* PIO2_10 */
#define SCT0_IN3_PIO2_10 IOPCTL_MUX(0, 74, 2) /* PIO2_10 */
#define SCT0_IN4_PIO2_10 IOPCTL_MUX(0, 74, 2) /* PIO2_10 */
#define SCT0_IN5_PIO2_10 IOPCTL_MUX(0, 74, 2) /* PIO2_10 */
#define SCT0_IN6_PIO2_10 IOPCTL_MUX(0, 74, 2) /* PIO2_10 */
#define SD0_RESET_N_PIO2_10 IOPCTL_MUX(0, 74, 1) /* PIO2_10 */
#define CTIMER2_MATCH1_PIO2_11 IOPCTL_MUX(0, 75, 4) /* PIO2_11 */
#define GPIO_PIO211_PIO2_11 IOPCTL_MUX(0, 75, 0) /* PIO2_11 */
#define SCT0_IN0_PIO2_11 IOPCTL_MUX(0, 75, 2) /* PIO2_11 */
#define SCT0_IN1_PIO2_11 IOPCTL_MUX(0, 75, 2) /* PIO2_11 */
#define SCT0_IN2_PIO2_11 IOPCTL_MUX(0, 75, 2) /* PIO2_11 */
#define SCT0_IN3_PIO2_11 IOPCTL_MUX(0, 75, 2) /* PIO2_11 */
#define SCT0_IN4_PIO2_11 IOPCTL_MUX(0, 75, 2) /* PIO2_11 */
#define SCT0_IN5_PIO2_11 IOPCTL_MUX(0, 75, 2) /* PIO2_11 */
#define SCT0_IN6_PIO2_11 IOPCTL_MUX(0, 75, 2) /* PIO2_11 */
#define SD0_VOLT_PIO2_11 IOPCTL_MUX(0, 75, 1) /* PIO2_11 */
#define CTIMER2_MATCH2_PIO2_12 IOPCTL_MUX(0, 76, 4) /* PIO2_12 */
#define GPIO_PIO212_PIO2_12 IOPCTL_MUX(0, 76, 0) /* PIO2_12 */
#define SCT0_OUT6_PIO2_12 IOPCTL_MUX(0, 76, 2) /* PIO2_12 */
#define CMP0_OUT_PIO2_13 IOPCTL_MUX(0, 77, 7) /* PIO2_13 */
#define CTIMER2_MATCH3_PIO2_13 IOPCTL_MUX(0, 77, 4) /* PIO2_13 */
#define GPIO_PIO213_PIO2_13 IOPCTL_MUX(0, 77, 0) /* PIO2_13 */
#define SCT0_OUT7_PIO2_13 IOPCTL_MUX(0, 77, 2) /* PIO2_13 */
#define CMP_IN1_PIO2_14 IOPCTL_MUX(0, 78, 0) /* PIO2_14 */
#define CTIMER0_CAPTURE0_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER0_CAPTURE1_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER0_CAPTURE2_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER0_CAPTURE3_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER1_CAPTURE0_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER1_CAPTURE1_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER1_CAPTURE2_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER1_CAPTURE3_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER2_CAPTURE0_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER2_CAPTURE1_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER2_CAPTURE2_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER2_CAPTURE3_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER3_CAPTURE0_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER3_CAPTURE1_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER3_CAPTURE2_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER3_CAPTURE3_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER4_CAPTURE0_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER4_CAPTURE1_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER4_CAPTURE2_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define CTIMER4_CAPTURE3_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define GPIO_PIO214_PIO2_14 IOPCTL_MUX(0, 78, 0) /* PIO2_14 */
#define SCT0_OUT8_PIO2_14 IOPCTL_MUX(0, 78, 2) /* PIO2_14 */
#define CLKIN_PIO2_15 IOPCTL_MUX(0, 79, 7) /* PIO2_15 */
#define CMP_IN4_PIO2_15 IOPCTL_MUX(0, 79, 0) /* PIO2_15 */
#define GPIO_PIO215_PIO2_15 IOPCTL_MUX(0, 79, 0) /* PIO2_15 */
#define SCT0_OUT9_PIO2_15 IOPCTL_MUX(0, 79, 2) /* PIO2_15 */
#define DMIC0_CLK0_1_PIO2_16 IOPCTL_MUX(0, 80, 1) /* PIO2_16 */
#define GPIO_PIO216_PIO2_16 IOPCTL_MUX(0, 80, 0) /* PIO2_16 */
#define DMIC0_CLK2_3_PIO2_17 IOPCTL_MUX(0, 81, 1) /* PIO2_17 */
#define FLEXSPI0B_DATA4_PIO2_17 IOPCTL_MUX(0, 81, 6) /* PIO2_17 */
#define GPIO_PIO217_PIO2_17 IOPCTL_MUX(0, 81, 0) /* PIO2_17 */
#define DMIC0_CLK4_5_PIO2_18 IOPCTL_MUX(0, 82, 1) /* PIO2_18 */
#define FLEXSPI0B_DATA5_PIO2_18 IOPCTL_MUX(0, 82, 6) /* PIO2_18 */
#define GPIO_PIO218_PIO2_18 IOPCTL_MUX(0, 82, 0) /* PIO2_18 */
#define DMIC0_CLK6_7_PIO2_19 IOPCTL_MUX(0, 83, 1) /* PIO2_19 */
#define FLEXSPI0B_SS0_N_PIO2_19 IOPCTL_MUX(0, 83, 6) /* PIO2_19 */
#define GPIO_PIO219_PIO2_19 IOPCTL_MUX(0, 83, 0) /* PIO2_19 */
#define DMIC0_DATA0_1_PIO2_20 IOPCTL_MUX(0, 84, 1) /* PIO2_20 */
#define GPIO_PIO220_PIO2_20 IOPCTL_MUX(0, 84, 0) /* PIO2_20 */
#define CTIMER0_CAPTURE0_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER0_CAPTURE1_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER0_CAPTURE2_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER0_CAPTURE3_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER1_CAPTURE0_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER1_CAPTURE1_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER1_CAPTURE2_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER1_CAPTURE3_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER2_CAPTURE0_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER2_CAPTURE1_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER2_CAPTURE2_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER2_CAPTURE3_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER3_CAPTURE0_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER3_CAPTURE1_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER3_CAPTURE2_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER3_CAPTURE3_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER4_CAPTURE0_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER4_CAPTURE1_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER4_CAPTURE2_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define CTIMER4_CAPTURE3_PIO2_21 IOPCTL_MUX(0, 85, 4) /* PIO2_21 */
#define DMIC0_DATA2_3_PIO2_21 IOPCTL_MUX(0, 85, 1) /* PIO2_21 */
#define FLEXSPI0B_SS1_N_PIO2_21 IOPCTL_MUX(0, 85, 6) /* PIO2_21 */
#define GPIO_PIO221_PIO2_21 IOPCTL_MUX(0, 85, 0) /* PIO2_21 */
#define DMIC0_DATA4_5_PIO2_22 IOPCTL_MUX(0, 86, 1) /* PIO2_22 */
#define FLEXSPI0B_DATA6_PIO2_22 IOPCTL_MUX(0, 86, 6) /* PIO2_22 */
#define GPIO_PIO222_PIO2_22 IOPCTL_MUX(0, 86, 0) /* PIO2_22 */
#define DMIC0_DATA6_7_PIO2_23 IOPCTL_MUX(0, 87, 1) /* PIO2_23 */
#define FLEXSPI0B_DATA7_PIO2_23 IOPCTL_MUX(0, 87, 6) /* PIO2_23 */
#define GPIO_PIO223_PIO2_23 IOPCTL_MUX(0, 87, 0) /* PIO2_23 */
#define GPIO_INT_BMAT_PIO2_24 IOPCTL_MUX(0, 88, 6) /* PIO2_24 */
#define GPIO_PIO224_PIO2_24 IOPCTL_MUX(0, 88, 0) /* PIO2_24 */
#define SWO_PIO2_24 IOPCTL_MUX(0, 88, 1) /* PIO2_24 */
#define GPIO_PIO225_PIO2_25 IOPCTL_MUX(0, 89, 0) /* PIO2_25 */
#define SWCLK_PIO2_25 IOPCTL_MUX(0, 89, 1) /* PIO2_25 */
#define GPIO_PIO226_PIO2_26 IOPCTL_MUX(0, 90, 0) /* PIO2_26 */
#define SWDIO_PIO2_26 IOPCTL_MUX(0, 90, 1) /* PIO2_26 */
#define GPIO_PIO227_PIO2_27 IOPCTL_MUX(0, 91, 0) /* PIO2_27 */
#define USB1_OVERCURRENTN_PIO2_27 IOPCTL_MUX(0, 91, 1) /* PIO2_27 */
#define GPIO_PIO228_PIO2_28 IOPCTL_MUX(0, 92, 0) /* PIO2_28 */
#define USB1_PORTPWRN_PIO2_28 IOPCTL_MUX(0, 92, 1) /* PIO2_28 */
#define CLKOUT_PIO2_29 IOPCTL_MUX(0, 93, 5) /* PIO2_29 */
#define GPIO_PIO229_PIO2_29 IOPCTL_MUX(0, 93, 0) /* PIO2_29 */
#define I3C0_SCL_PIO2_29 IOPCTL_MUX(0, 93, 1) /* PIO2_29 */
#define SCT0_OUT0_PIO2_29 IOPCTL_MUX(0, 93, 2) /* PIO2_29 */
#define CLKIN_PIO2_30 IOPCTL_MUX(0, 94, 5) /* PIO2_30 */
#define CMP0_OUT_PIO2_30 IOPCTL_MUX(0, 94, 7) /* PIO2_30 */
#define GPIO_PIO230_PIO2_30 IOPCTL_MUX(0, 94, 0) /* PIO2_30 */
#define I3C0_SDA_PIO2_30 IOPCTL_MUX(0, 94, 1) /* PIO2_30 */
#define SCT0_OUT3_PIO2_30 IOPCTL_MUX(0, 94, 2) /* PIO2_30 */
#define CMP_IN2_PIO2_31 IOPCTL_MUX(0, 95, 0) /* PIO2_31 */
#define CTIMER0_CAPTURE0_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER0_CAPTURE1_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER0_CAPTURE2_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER0_CAPTURE3_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER1_CAPTURE0_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER1_CAPTURE1_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER1_CAPTURE2_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER1_CAPTURE3_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER2_CAPTURE0_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER2_CAPTURE1_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER2_CAPTURE2_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER2_CAPTURE3_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER3_CAPTURE0_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER3_CAPTURE1_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER3_CAPTURE2_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER3_CAPTURE3_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER4_CAPTURE0_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER4_CAPTURE1_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER4_CAPTURE2_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define CTIMER4_CAPTURE3_PIO2_31 IOPCTL_MUX(0, 95, 4) /* PIO2_31 */
#define GPIO_PIO231_PIO2_31 IOPCTL_MUX(0, 95, 0) /* PIO2_31 */
#define I3C0_PUR_PIO2_31 IOPCTL_MUX(0, 95, 1) /* PIO2_31 */
#define SCT0_OUT7_PIO2_31 IOPCTL_MUX(0, 95, 2) /* PIO2_31 */
#define SWO_PIO2_31 IOPCTL_MUX(0, 95, 5) /* PIO2_31 */
#define UTICK0_CAPTURE3_PIO2_31 IOPCTL_MUX(0, 95, 3) /* PIO2_31 */
#define DMIC0_CLK0_1_PIO3_0 IOPCTL_MUX(0, 96, 1) /* PIO3_0 */
#define FC0_SCK_PIO3_0 IOPCTL_MUX(0, 96, 5) /* PIO3_0 */
#define GPIO_PIO30_PIO3_0 IOPCTL_MUX(0, 96, 0) /* PIO3_0 */
#define DMIC0_CLK2_3_PIO3_1 IOPCTL_MUX(0, 97, 1) /* PIO3_1 */
#define FC0_TXD_SCL_MISO_WS_PIO3_1 IOPCTL_MUX(0, 97, 5) /* PIO3_1 */
#define GPIO_PIO31_PIO3_1 IOPCTL_MUX(0, 97, 0) /* PIO3_1 */
#define DMIC0_CLK4_5_PIO3_2 IOPCTL_MUX(0, 98, 1) /* PIO3_2 */
