zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFFOB-pinctrl.h
#define FC0_RXD_SDA_MOSI_DATA_PIO3_2 IOPCTL_MUX(0, 98, 5) /* PIO3_2 */
#define GPIO_PIO32_PIO3_2 IOPCTL_MUX(0, 98, 0) /* PIO3_2 */
#define CMP0_OUT_PIO3_3 IOPCTL_MUX(0, 99, 7) /* PIO3_3 */
#define DMIC0_CLK6_7_PIO3_3 IOPCTL_MUX(0, 99, 1) /* PIO3_3 */
#define FC0_CTS_SDA_SSEL0_PIO3_3 IOPCTL_MUX(0, 99, 5) /* PIO3_3 */
#define GPIO_PIO33_PIO3_3 IOPCTL_MUX(0, 99, 0) /* PIO3_3 */
#define DMIC0_DATA0_1_PIO3_4 IOPCTL_MUX(0, 100, 1) /* PIO3_4 */
#define FC0_RTS_SCL_SSEL1_PIO3_4 IOPCTL_MUX(0, 100, 5) /* PIO3_4 */
#define GPIO_PIO34_PIO3_4 IOPCTL_MUX(0, 100, 0) /* PIO3_4 */
#define DMIC0_DATA2_3_PIO3_5 IOPCTL_MUX(0, 101, 1) /* PIO3_5 */
#define FC0_SSEL2_PIO3_5 IOPCTL_MUX(0, 101, 5) /* PIO3_5 */
#define GPIO_PIO35_PIO3_5 IOPCTL_MUX(0, 101, 0) /* PIO3_5 */
#define DMIC0_DATA4_5_PIO3_6 IOPCTL_MUX(0, 102, 1) /* PIO3_6 */
#define FC0_SSEL3_PIO3_6 IOPCTL_MUX(0, 102, 5) /* PIO3_6 */
#define GPIO_PIO36_PIO3_6 IOPCTL_MUX(0, 102, 0) /* PIO3_6 */
#define DMIC0_DATA6_7_PIO3_7 IOPCTL_MUX(0, 103, 1) /* PIO3_7 */
#define GPIO_PIO37_PIO3_7 IOPCTL_MUX(0, 103, 0) /* PIO3_7 */
#define CTIMER0_MATCH0_PIO3_8 IOPCTL_MUX(0, 104, 4) /* PIO3_8 */
#define GPIO_PIO38_PIO3_8 IOPCTL_MUX(0, 104, 0) /* PIO3_8 */
#define SD1_CLK_PIO3_8 IOPCTL_MUX(0, 104, 1) /* PIO3_8 */
#define CTIMER0_MATCH1_PIO3_9 IOPCTL_MUX(0, 105, 4) /* PIO3_9 */
#define GPIO_PIO39_PIO3_9 IOPCTL_MUX(0, 105, 0) /* PIO3_9 */
#define SD1_CMD_PIO3_9 IOPCTL_MUX(0, 105, 1) /* PIO3_9 */
#define CTIMER0_MATCH2_PIO3_10 IOPCTL_MUX(0, 106, 4) /* PIO3_10 */
#define GPIO_PIO310_PIO3_10 IOPCTL_MUX(0, 106, 0) /* PIO3_10 */
#define USDHC1_USDHC_DATA0_PIO3_10 IOPCTL_MUX(0, 106, 1) /* PIO3_10 */
#define CTIMER0_MATCH3_PIO3_11 IOPCTL_MUX(0, 107, 4) /* PIO3_11 */
#define GPIO_PIO311_PIO3_11 IOPCTL_MUX(0, 107, 0) /* PIO3_11 */
#define USDHC1_USDHC_DATA1_PIO3_11 IOPCTL_MUX(0, 107, 1) /* PIO3_11 */
#define CTIMER0_CAPTURE0_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER0_CAPTURE1_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER0_CAPTURE2_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER0_CAPTURE3_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER1_CAPTURE0_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER1_CAPTURE1_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER1_CAPTURE2_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER1_CAPTURE3_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER2_CAPTURE0_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER2_CAPTURE1_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER2_CAPTURE2_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER2_CAPTURE3_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER3_CAPTURE0_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER3_CAPTURE1_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER3_CAPTURE2_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER3_CAPTURE3_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER4_CAPTURE0_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER4_CAPTURE1_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER4_CAPTURE2_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define CTIMER4_CAPTURE3_PIO3_12 IOPCTL_MUX(0, 108, 4) /* PIO3_12 */
#define GPIO_PIO312_PIO3_12 IOPCTL_MUX(0, 108, 0) /* PIO3_12 */
#define USDHC1_USDHC_DATA2_PIO3_12 IOPCTL_MUX(0, 108, 1) /* PIO3_12 */
#define CTIMER0_CAPTURE0_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER0_CAPTURE1_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER0_CAPTURE2_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER0_CAPTURE3_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER1_CAPTURE0_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER1_CAPTURE1_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER1_CAPTURE2_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER1_CAPTURE3_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER2_CAPTURE0_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER2_CAPTURE1_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER2_CAPTURE2_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER2_CAPTURE3_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER3_CAPTURE0_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER3_CAPTURE1_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER3_CAPTURE2_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER3_CAPTURE3_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER4_CAPTURE0_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER4_CAPTURE1_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER4_CAPTURE2_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define CTIMER4_CAPTURE3_PIO3_13 IOPCTL_MUX(0, 109, 4) /* PIO3_13 */
#define GPIO_PIO313_PIO3_13 IOPCTL_MUX(0, 109, 0) /* PIO3_13 */
#define USDHC1_USDHC_DATA3_PIO3_13 IOPCTL_MUX(0, 109, 1) /* PIO3_13 */
#define CTIMER3_MATCH0_PIO3_14 IOPCTL_MUX(0, 110, 4) /* PIO3_14 */
#define GPIO_PIO314_PIO3_14 IOPCTL_MUX(0, 110, 0) /* PIO3_14 */
#define SD1_WR_PRT_PIO3_14 IOPCTL_MUX(0, 110, 1) /* PIO3_14 */
#define CTIMER3_MATCH1_PIO3_15 IOPCTL_MUX(0, 111, 4) /* PIO3_15 */
#define FC5_SCK_PIO3_15 IOPCTL_MUX(0, 111, 5) /* PIO3_15 */
#define GPIO_PIO315_PIO3_15 IOPCTL_MUX(0, 111, 0) /* PIO3_15 */
#define USDHC1_USDHC_DATA4_PIO3_15 IOPCTL_MUX(0, 111, 1) /* PIO3_15 */
#define CTIMER3_MATCH2_PIO3_16 IOPCTL_MUX(0, 112, 4) /* PIO3_16 */
#define FC5_TXD_SCL_MISO_WS_PIO3_16 IOPCTL_MUX(0, 112, 5) /* PIO3_16 */
#define GPIO_PIO316_PIO3_16 IOPCTL_MUX(0, 112, 0) /* PIO3_16 */
#define USDHC1_USDHC_DATA5_PIO3_16 IOPCTL_MUX(0, 112, 1) /* PIO3_16 */
#define CTIMER3_MATCH3_PIO3_17 IOPCTL_MUX(0, 113, 4) /* PIO3_17 */
#define FC5_RXD_SDA_MOSI_DATA_PIO3_17 IOPCTL_MUX(0, 113, 5) /* PIO3_17 */
#define GPIO_PIO317_PIO3_17 IOPCTL_MUX(0, 113, 0) /* PIO3_17 */
#define USDHC1_USDHC_DATA6_PIO3_17 IOPCTL_MUX(0, 113, 1) /* PIO3_17 */
#define CTIMER4_MATCH0_PIO3_18 IOPCTL_MUX(0, 114, 4) /* PIO3_18 */
#define FC5_CTS_SDA_SSEL0_PIO3_18 IOPCTL_MUX(0, 114, 5) /* PIO3_18 */
#define GPIO_PIO318_PIO3_18 IOPCTL_MUX(0, 114, 0) /* PIO3_18 */
#define USDHC1_USDHC_DATA7_PIO3_18 IOPCTL_MUX(0, 114, 1) /* PIO3_18 */
#define CTIMER4_MATCH1_PIO3_19 IOPCTL_MUX(0, 115, 4) /* PIO3_19 */
#define GPIO_PIO319_PIO3_19 IOPCTL_MUX(0, 115, 0) /* PIO3_19 */
#define MCLK_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SCT0_IN0_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SCT0_IN1_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SCT0_IN2_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SCT0_IN3_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SCT0_IN4_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SCT0_IN5_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SCT0_IN6_PIO3_19 IOPCTL_MUX(0, 115, 5) /* PIO3_19 */
#define SD1_CARD_DET_N_PIO3_19 IOPCTL_MUX(0, 115, 1) /* PIO3_19 */
#define CTIMER4_MATCH2_PIO3_20 IOPCTL_MUX(0, 116, 4) /* PIO3_20 */
#define GPIO_PIO320_PIO3_20 IOPCTL_MUX(0, 116, 0) /* PIO3_20 */
#define SD1_RESET_N_PIO3_20 IOPCTL_MUX(0, 116, 1) /* PIO3_20 */
#define CTIMER4_MATCH3_PIO3_21 IOPCTL_MUX(0, 117, 4) /* PIO3_21 */
#define GPIO_INT_BMAT_PIO3_21 IOPCTL_MUX(0, 117, 6) /* PIO3_21 */
#define GPIO_PIO321_PIO3_21 IOPCTL_MUX(0, 117, 0) /* PIO3_21 */
#define SD1_VOLT_PIO3_21 IOPCTL_MUX(0, 117, 1) /* PIO3_21 */
#define FC5_RTS_SCL_SSEL1_PIO3_22 IOPCTL_MUX(0, 118, 5) /* PIO3_22 */
#define GPIO_PIO322_PIO3_22 IOPCTL_MUX(0, 118, 0) /* PIO3_22 */
#define ADC0_CH5_PIO3_23 IOPCTL_MUX(0, 119, 0) /* PIO3_23 */
#define FC5_SSEL2_PIO3_23 IOPCTL_MUX(0, 119, 5) /* PIO3_23 */
#define GPIO_PIO323_PIO3_23 IOPCTL_MUX(0, 119, 0) /* PIO3_23 */
#define ADC0_CH13_PIO3_24 IOPCTL_MUX(0, 120, 0) /* PIO3_24 */
#define FC5_SSEL3_PIO3_24 IOPCTL_MUX(0, 120, 5) /* PIO3_24 */
#define GPIO_PIO324_PIO3_24 IOPCTL_MUX(0, 120, 0) /* PIO3_24 */
#define FC6_SCK_PIO3_25 IOPCTL_MUX(0, 121, 1) /* PIO3_25 */
#define GPIO_PIO325_PIO3_25 IOPCTL_MUX(0, 121, 0) /* PIO3_25 */
#define FC6_TXD_SCL_MISO_WS_PIO3_26 IOPCTL_MUX(0, 122, 1) /* PIO3_26 */
#define GPIO_PIO326_PIO3_26 IOPCTL_MUX(0, 122, 0) /* PIO3_26 */
#define FC6_RXD_SDA_MOSI_DATA_PIO3_27 IOPCTL_MUX(0, 123, 1) /* PIO3_27 */
#define GPIO_PIO327_PIO3_27 IOPCTL_MUX(0, 123, 0) /* PIO3_27 */
#define FC6_CTS_SDA_SSEL0_PIO3_28 IOPCTL_MUX(0, 124, 1) /* PIO3_28 */
#define GPIO_PIO328_PIO3_28 IOPCTL_MUX(0, 124, 0) /* PIO3_28 */
#define FC6_RTS_SCL_SSEL1_PIO3_29 IOPCTL_MUX(0, 125, 1) /* PIO3_29 */
#define GPIO_PIO329_PIO3_29 IOPCTL_MUX(0, 125, 0) /* PIO3_29 */
#define FC6_SSEL2_PIO3_30 IOPCTL_MUX(0, 126, 1) /* PIO3_30 */
#define GPIO_PIO330_PIO3_30 IOPCTL_MUX(0, 126, 0) /* PIO3_30 */
#define FC6_SSEL3_PIO3_31 IOPCTL_MUX(0, 127, 1) /* PIO3_31 */
#define GPIO_PIO331_PIO3_31 IOPCTL_MUX(0, 127, 0) /* PIO3_31 */
#define CLKOUT_PIO4_0 IOPCTL_MUX(0, 128, 7) /* PIO4_0 */
#define FC7_SCK_PIO4_0 IOPCTL_MUX(0, 128, 1) /* PIO4_0 */
#define FREQME_IN0_PIO4_0 IOPCTL_MUX(0, 128, 4) /* PIO4_0 */
#define FREQME_IN1_PIO4_0 IOPCTL_MUX(0, 128, 4) /* PIO4_0 */
#define GPIO_PIO40_PIO4_0 IOPCTL_MUX(0, 128, 0) /* PIO4_0 */
#define CLKIN_PIO4_1 IOPCTL_MUX(0, 129, 7) /* PIO4_1 */
#define FC7_TXD_SCL_MISO_WS_PIO4_1 IOPCTL_MUX(0, 129, 1) /* PIO4_1 */
#define GPIO_PIO41_PIO4_1 IOPCTL_MUX(0, 129, 0) /* PIO4_1 */
#define FC7_RXD_SDA_MOSI_DATA_PIO4_2 IOPCTL_MUX(0, 130, 1) /* PIO4_2 */
#define GPIO_PIO42_PIO4_2 IOPCTL_MUX(0, 130, 0) /* PIO4_2 */
#define FC7_CTS_SDA_SSEL0_PIO4_3 IOPCTL_MUX(0, 131, 1) /* PIO4_3 */
#define GPIO_PIO43_PIO4_3 IOPCTL_MUX(0, 131, 0) /* PIO4_3 */
#define FC7_RTS_SCL_SSEL1_PIO4_4 IOPCTL_MUX(0, 132, 1) /* PIO4_4 */
#define GPIO_PIO44_PIO4_4 IOPCTL_MUX(0, 132, 0) /* PIO4_4 */
#define FC7_SSEL2_PIO4_5 IOPCTL_MUX(0, 133, 1) /* PIO4_5 */
#define GPIO_PIO45_PIO4_5 IOPCTL_MUX(0, 133, 0) /* PIO4_5 */
#define FC7_SSEL3_PIO4_6 IOPCTL_MUX(0, 134, 1) /* PIO4_6 */
#define GPIO_PIO46_PIO4_6 IOPCTL_MUX(0, 134, 0) /* PIO4_6 */
#define GPIO_PIO47_PIO4_7 IOPCTL_MUX(0, 135, 0) /* PIO4_7 */
#define MCLK_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define SCT0_IN0_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define SCT0_IN1_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define SCT0_IN2_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define SCT0_IN3_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define SCT0_IN4_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define SCT0_IN5_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define SCT0_IN6_PIO4_7 IOPCTL_MUX(0, 135, 1) /* PIO4_7 */
#define CMP0_OUT_PIO4_8 IOPCTL_MUX(0, 136, 7) /* PIO4_8 */
#define FC2_CTS_SDA_SSEL0_PIO4_8 IOPCTL_MUX(0, 136, 5) /* PIO4_8 */
#define GPIO_PIO48_PIO4_8 IOPCTL_MUX(0, 136, 0) /* PIO4_8 */
#define GPIO_INT_BMAT_PIO4_9 IOPCTL_MUX(0, 137, 6) /* PIO4_9 */
#define GPIO_PIO49_PIO4_9 IOPCTL_MUX(0, 137, 0) /* PIO4_9 */
#define FC2_SCK_PIO7_24 IOPCTL_MUX(0, 248, 5) /* PIO7_24 */
#define GPIO_PIO724_PIO7_24 IOPCTL_MUX(0, 248, 0) /* PIO7_24 */
#define FC1_SCK_PIO7_25 IOPCTL_MUX(0, 249, 1) /* PIO7_25 */
#define GPIO_PIO725_PIO7_25 IOPCTL_MUX(0, 249, 0) /* PIO7_25 */
#define FC1_TXD_SCL_MISO_WS_PIO7_26 IOPCTL_MUX(0, 250, 1) /* PIO7_26 */
#define GPIO_PIO726_PIO7_26 IOPCTL_MUX(0, 250, 0) /* PIO7_26 */
#define FC1_RXD_SDA_MOSI_DATA_PIO7_27 IOPCTL_MUX(0, 251, 1) /* PIO7_27 */
#define GPIO_PIO727_PIO7_27 IOPCTL_MUX(0, 251, 0) /* PIO7_27 */
#define FC1_CTS_SDA_SSEL0_PIO7_28 IOPCTL_MUX(0, 252, 1) /* PIO7_28 */
#define GPIO_PIO728_PIO7_28 IOPCTL_MUX(0, 252, 0) /* PIO7_28 */
#define FC1_RTS_SCL_SSEL1_PIO7_29 IOPCTL_MUX(0, 253, 1) /* PIO7_29 */
#define GPIO_PIO729_PIO7_29 IOPCTL_MUX(0, 253, 0) /* PIO7_29 */
#define FC1_SSEL2_PIO7_30 IOPCTL_MUX(0, 254, 1) /* PIO7_30 */
#define FC2_TXD_SCL_MISO_WS_PIO7_30 IOPCTL_MUX(0, 254, 5) /* PIO7_30 */
#define GPIO_PIO730_PIO7_30 IOPCTL_MUX(0, 254, 0) /* PIO7_30 */
#define FC1_SSEL3_PIO7_31 IOPCTL_MUX(0, 255, 1) /* PIO7_31 */
#define FC2_RXD_SDA_MOSI_DATA_PIO7_31 IOPCTL_MUX(0, 255, 5) /* PIO7_31 */
#define GPIO_PIO731_PIO7_31 IOPCTL_MUX(0, 255, 0) /* PIO7_31 */

#endif
